{
  "id": 102,
  "name": "exeggcute",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "grass",
        "url": "https://pokeapi.co/api/v2/type/12/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "psychic",
        "url": "https://pokeapi.co/api/v2/type/14/"
      }
    }
  ],
  "flavor_text_entries": [
    "Using telepathy only they can employ, they always form a cluster of six Exeggcute.",
    "Though it may look like it’s just a bunch of eggs, it’s a proper Pokémon. Exeggcute communicates with others of its kind via telepathy, apparently.",
    "Even though it appears to be eggs of some sort, it was discovered to be a life-form more like plant seeds.",
    "Its six eggs use telepathy to communicate among themselves. It is believed to carry plant genes and the genes of other species.",
    "The heads attract each other and spin around. There must be six heads for it to maintain balance.",
    "It is often mistaken for eggs. When disturbed, they quickly gather and attack in swarms.",
    "The shell is very durable. Even if it cracks, it can survive without spilling the contents.",
    "Even though it appears to be eggs of some sort, it was discovered to be a life- form more like plant seeds.",
    "These Pokémon get nervous when they’re not in a group of six. The minute even one member of the group goes missing, Exeggcute become cowardly.",
    "If even one is separated from the group, the energy bond between the six will make them rejoin instantly.",
    "Often mistaken for eggs. When disturbed, they quickly gather and attack in swarms.",
    "Six of them form a single Pokémon. Should one of the six be lost, the next morning there will once more be six.",
    "The heads attract each other and spin around. There must be 6 heads for it to maintain balance.",
    "Its six eggs converse using telepathy. They can quickly gather if they become separated.",
    "Six of them together form a full-fledged Pokémon. It’s often hunted by Crabrawler, but uses psychokinesis to drive it off.",
    "Although they are the same size as other Exeggcute, the ones produced in Alola are quite heavy. Their shells are packed full.",
    "This Pokémon consists of six eggs that form a closely knit cluster. The six eggs attract each other and spin around. When cracks increasingly appear on the eggs, Exeggcute is close to evolution.",
    "Their shells are very durable. Even if they crack, they can survive without spilling their contents.",
    "Using telepathy only they can receive, they always form a cluster of six Exeggcute.",
    "It consists of six eggs that care for each other. The eggs attract each other and spin around. When cracks increasingly appear, it is close to evolution."
  ],
  "genera": [
    {
      "genus": "Egg Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}