{
  "id": 103,
  "name": "exeggutor",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "grass",
        "url": "https://pokeapi.co/api/v2/type/12/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "psychic",
        "url": "https://pokeapi.co/api/v2/type/14/"
      }
    }
  ],
  "flavor_text_entries": [
    "Originally from the tropics, Exeggutor’s heads grow larger from exposure to strong sunlight. It is said that when the heads fall, they group to form an EXEGGCUTE.",
    "Exeggutor originally came from the tropics. Its heads steadily grow larger from exposure to strong sunlight. It is said that when the heads fall off, they group together to form EXEGGCUTE.",
    "When they work together, Exeggutor’s three heads can put out powerful psychic energy. Cloudy days make this Pokémon sluggish.",
    "It is called “The Walking Jungle. ” If a head grows too big, it falls off and becomes an Exeggcute.",
    "Living in a good environment makes it grow lots of heads. A head that drops off becomes an EXEGGCUTE.",
    "When the time comes, one of its three heads falls off. Before long, the fallen head grows into an Exeggcute.",
    "Its cries are very noisy. This is because each of the 3 heads thinks about whatever it likes.",
    "Exeggutor originally came from the tropics. Its heads steadily grow larger from exposure to strong sunlight. It is said that when the heads fall off, they group together to form Exeggcute.",
    "It is called “The Walking Jungle. ” If a head grows too big, it falls off and becomes an EXEGGCUTE.",
    "It engages its enemies using psychic powers. Each of its three heads fires off psychokinetic energy, tripling its power.",
    "Its cries are very noisy. This is because each of the three heads thinks about whatever it likes.",
    "Each of its heads has its own will. They use telepathy to discuss their plans before coming to a joint decision.",
    "If a head drops off, it emits a telepathic call in search of others to form an EXEGGCUTE cluster.",
    "Legend has it that on rare occasions, one of its heads will drop off and continue on as an EXEGGCUTE.",
    "Its three heads think independently. However, they are friendly and never appear to squabble.",
    "It is called “The Walking Tropical Rainforest. ” Each of the nuts has a face and a will of its own.",
    "Each of its three heads has its own thoughts. When they want to go in different directions, Exeggutor becomes unable to move.",
    "It is said that on rare occasions, one of its heads will drop off and continue on as an EXEGGCUTE.",
    "Each of Exeggutor’s three heads is thinking different thoughts. The three don’t seem to be very interested in one another."
  ],
  "genera": [
    {
      "genus": "Coconut Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}