{
  "id": 105,
  "name": "marowak",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "ground",
        "url": "https://pokeapi.co/api/v2/type/5/"
      }
    }
  ],
  "flavor_text_entries": [
    "Marowak is the evolved form of a CUBONE that has overcome its sadness at the loss of its mother and grown tough. This Pokémon’s tempered and hardened spirit is not easily broken.",
    "A Marowak is the evolved form of a CUBONE that has grown tough by overcoming the grief of losing its mother. Its tempered and hardened spirit is not easily broken.",
    "The bone it holds is its key weapon. It throws the bone skillfully like a boomerang to KO targets.",
    "This Pokémon is out for vengeance on its natural enemy, Mandibuzz. It throws bones like boomerangs to try to take it down.",
    "Somewhere in the world is a cemetery just for Marowak. It gets its bones from those graves.",
    "It collects bones from an unknown place. Some whisper that a Marowak graveyard exists somewhere in the world.",
    "Small and weak, this Pokémon is adept with its bone club. It has grown more vicious over the ages.",
    "This Pokémon overcame its sorrow to evolve a sturdy new body. Marowak faces its opponents bravely, using a bone as a weapon.",
    "It has been seen pounding boulders with the bone it carries in order to tap out messages to others.",
    "Originally, it was weak and timid. After evolution, its temperament becomes violent, and it begins to wield bones as weapons.",
    "It is small and was originally very weak. Its temperament turned ferocious when it began using bones.",
    "It collects bones from an unknown place. A Marowak graveyard exists somewhere in the world, rumors say.",
    "From its birth, this savage Pokémon constantly holds bones. It is skilled in using them as weapons.",
    "It throws bones at Mandibuzz to knock it down. It’s thought that Marowak is trying to avenge its parent.",
    "Marowak is the evolved form of a Cubone that has overcome its sadness at the loss of its mother and grown tough. This Pokémon’s tempered and hardened spirit is not easily broken.",
    "They thump their bones rhythmically to communicate among themselves. There are nearly 50 different rhythmic patterns.",
    "When this Pokémon evolved, the skull of its mother fused to it. Marowak’s temperament also turned vicious at the same time."
  ],
  "genera": [
    {
      "genus": "Bone Keeper Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}