{
  "id": 109,
  "name": "koffing",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "poison",
        "url": "https://pokeapi.co/api/v2/type/4/"
      }
    }
  ],
  "flavor_text_entries": [
    "Because it stores several kinds of toxic gases in its body, it is prone to exploding without warning.",
    "If Koffing becomes agitated, it raises the toxicity of its internal gases and jets them out from all over its body. This Pokémon may also overinflate its round body, then explode.",
    "Koffing embodies toxic substances. It mixes the toxins with raw garbage to set off a chemical reaction that results in a terribly powerful poison gas. The higher the temperature, the more gas is concocted by this Pokémon.",
    "It adores polluted air. Some claim that Koffing used to be more plentiful in the Galar region than they are now.",
    "In hot places, its internal gases could expand and explode without any warning. Be very careful!",
    "If one gets close enough to it when it expels poison­ ous gas, the gas swirling inside it can be seen.",
    "Its thin, filmy body is filled with gases that cause constant sniffles, coughs and teary eyes.",
    "Getting up close to a Koffing will give you a chance to observe, through its thin skin, the toxic gases swirling inside. It blows up at the slightest stimulation.",
    "Lighter-than-air gases in its body keep it aloft. The gases not only smell, they are also explosive.",
    "Its thin, balloon-like body is inflated by horribly toxic gases. It reeks when it is nearby.",
    "Toxic gas is held within its thin, balloon-shaped body, so it can cause massive explosions.",
    "The poisonous gases it contains are a little bit lighter than air, keeping it slightly airborne.",
    "Its body is full of poisonous gas. It floats into garbage dumps, seeking out the fumes of raw, rotting trash."
  ],
  "genera": [
    {
      "genus": "Poison Gas Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}