{
  "id": 118,
  "name": "goldeen",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "water",
        "url": "https://pokeapi.co/api/v2/type/11/"
      }
    }
  ],
  "flavor_text_entries": [
    "Spellbound by the length of its horn and the beauty of its fins, many strange Trainers raise Goldeen and nothing but Goldeen.",
    "Goldeen loves swimming wild and free in rivers and ponds. If one of these Pokémon is placed in an aquarium, it will shatter even the thickest glass with one ram of its horn and make its escape.",
    "The way it swims along fluttering its dress-like fins has earned it the name “princess of the water. ”",
    "During spawning season, they swim gracefully in the water, searching for their perfect mate.",
    "When the weather grows warm, they form groups and swim upriver. This sight serves as a poetic reminder that spring has arrived.",
    "Though it appears very elegant when swimming with fins unfurled, it can jab powerfully with its horn.",
    "Its dorsal, pectoral and tail fins wave elegantly in water. That is why it is known as the water dancer.",
    "In the springtime, schools of Goldeen can be seen swimming up falls and rivers. It metes out staggering damage with its single horn.",
    "Its dorsal and pectoral fins are strongly developed like muscles. It can swim at a speed of five knots.",
    "Its tail fin billows like an elegant ballroom dress, giving it the nickname of the Water Queen.",
    "Goldeen is a very beautiful Pokémon with fins that billow elegantly in water. However, don’t let your guard down around this Pokémon—it could ram you powerfully with its horn.",
    "A strong swimmer, it is capable of swimming nonstop up fast streams at a steady speed of five knots.",
    "A strong swimmer, it is capable of swimming nonstop up fast streams at a steady speed of five knots per hour.",
    "Goldeen is a very beautiful Pokémon with fins that billow elegantly in water. However, don’t let your guard down around this Pokémon - it could ram you powerfully with its horn.",
    "Its dorsal, pectoral, and tail fins wave elegantly in water. That is why it is known as the water dancer.",
    "Its dorsal, pectoral, and tail fins wave elegantly in water. That is why it is known as the Water Dancer.",
    "It swims elegantly by flittering its tail fin as if it were a dress. It has the look of a queen.",
    "Although known for their splendid tail fins, Goldeen apparently compete among themselves to see whose horn is thickest and sharpest.",
    "It swims at a steady 5 knots. If it senses danger, it will strike back with its sharp horn.",
    "Its tail fin billows like an elegant ballroom dress, giving it the nickname of “The Water Queen. ”",
    "When it is time for them to lay eggs, they can be seen swimming up rivers and falls in large groups."
  ],
  "genera": [
    {
      "genus": "Goldfish Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}