{
  "id": 121,
  "name": "starmie",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "water",
        "url": "https://pokeapi.co/api/v2/type/11/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "psychic",
        "url": "https://pokeapi.co/api/v2/type/14/"
      }
    }
  ],
  "flavor_text_entries": [
    "Its shining core is thought to receive and transmit enigmatic signals. It has been known to cause headaches in those who approach it.",
    "It rotates its geometrically shaped body to swim through the water. It always seems to be sending out mysterious radio waves.",
    "People in ancient times imagined that Starmie were transformed from the reflections of stars that twinkled on gentle waves at night.",
    "Its sparkling core is called “the gem of the sea. ” This core can be made into high-priced accessories that are traded in secret.",
    "It is said that it uses the seven- colored core of its body to send electric waves into outer space.",
    "The center section is named the core. People think it is communicating when it glows in seven colors.",
    "Starmie swims through water by spinning its star-shaped body as if it were a propeller on a ship. The core at the center of this Pokémon’s body glows in seven colors.",
    "Its central core glows with the seven colors of the rainbow. Some people value the core as a gem.",
    "The middle section of its body is called the core. It glows in a different color each time it is seen.",
    "Starmie swims by spinning its body at high speed. As this Pokémon cruises through the ocean, it absorbs tiny plankton.",
    "Starmie’s center section - the core - glows brightly in seven colors. Because of its luminous nature, this Pokémon has been given the nickname “the gem of the sea. ”",
    "Regardless of the environment it lives in, its body grows to form a symmetrical geometric shape.",
    "This Pokémon has an organ known as its core. The organ glows in seven colors when Starmie is unleashing its potent psychic powers.",
    "This Pokémon has a geometric body. Because of its body, the locals suspect that it is an alien creature.",
    "The center section of its body is called the core. It glows in a different color each time it is seen.",
    "At the center of its body is a red core, which sends mysterious radio signals into the night sky.",
    "Its unusual body shape, reminiscent of abstract art, led local people to spread rumors that this Pokémon may be an invader from outer space.",
    "Its core shines in many colors and sends radio signals into space to communicate with something.",
    "The center section is named the core. People think it is communicating when it glows in 7 colors.",
    "Starmie’s center section—the core—glows brightly in seven colors. Because of its luminous nature, this Pokémon has been given the nickname “the gem of the sea. ”"
  ],
  "genera": [
    {
      "genus": "Mysterious Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}