{
  "id": 122,
  "name": "mr-mime",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "psychic",
        "url": "https://pokeapi.co/api/v2/type/14/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "fairy",
        "url": "https://pokeapi.co/api/v2/type/18/"
      }
    }
  ],
  "flavor_text_entries": [
    "It is adept at conning people. It is said to be able to create walls out of thin air by miming.",
    "Always practices its pantomime act. It makes enemies believe something exists that really doesn't.",
    "Its fingertips emit a peculiar force field that hardens air to create an actual wall.",
    "Always practicing its pantomime act. It makes enemies believe something exists that really doesn’t.",
    "If interrupted while it is miming, it will slap around the offender with its broad hands.",
    "Emanations from its fingertips solidify the air into invisible walls that repel even harsh attacks.",
    "Mr. Mime is a master of pantomime. Its gestures and motions convince watchers that something unseeable actually exists. Once the watchers are convinced, the unseeable thing exists as if it were real.",
    "It shapes an invisible wall in midair by minutely vibrating its fingertips to stop molecules in the air.",
    "MR. MIME is a master of pantomime. Its gestures and motions convince watchers that something unseeable actually exists. Once it is believed, it will exist as if it were a real thing.",
    "If interrupted while it is miming, it will suddenly DOUBLESLAP the offender with its broad hands.",
    "Its pantomime skills are wonderful. You may become enraptured while watching it, but next thing you know, Mr. Mime has made a real wall.",
    "The broadness of its hands may be no coincidence—many scientists believe its palms became enlarged specifically for pantomiming.",
    "The behavior of this clown-like Pokémon reminds one of pantomime. It creates invisible walls using a force emitted from its fingertips.",
    "A skilled mime from birth, it gains the ability to create invisible objects as it matures.",
    "It uses the mysterious power it has in its fingers to solidify air into an invisible wall.",
    "A MR. MIME is a master of pantomime. It can convince others that something unseeable actually exists. Once believed, the imaginary object does become real.",
    "It creates invisible walls with its pantomiming. If you don’t act impressed, it will attack you with a double slap!",
    "It’s known for its top-notch pantomime skills. It protects itself from all sorts of attacks by emitting auras from its fingers to create walls.",
    "It is a pantomime expert that can create invisible but solid walls using miming gestures."
  ],
  "genera": [
    {
      "genus": "Barrier Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}