{
  "id": 124,
  "name": "jynx",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "ice",
        "url": "https://pokeapi.co/api/v2/type/15/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "psychic",
        "url": "https://pokeapi.co/api/v2/type/14/"
      }
    }
  ],
  "flavor_text_entries": [
    "A Jynx sashays rhythmically as if it were dancing. Its motions are so bouncingly alluring, people seeing it are compelled to shake their hips without noticing.",
    "It rocks its body rhythmically. It appears to alter the rhythm depending on how it is feeling.",
    "It wiggles its hips as it walks. It can cause people to dance in unison with it.",
    "Jynx walks rhythmically, swaying and shaking its hips as if it were dancing. Its motions are so bouncingly alluring, people seeing it are compelled to shake their hips without giving any thought to what they are doing.",
    "It seductively wiggles its hips as it walks. It can cause people to dance in unison with it.",
    "It speaks a language similar to that of humans. However, it seems to use dancing to communicate.",
    "It sways its hips to a rhythm all its own. The precise movements of Jynx living in Alola are truly wonderful.",
    "Its cries sound like human speech. However, it is impossible to tell what it is trying to say.",
    "The Jynx of Galar often have beautiful and delicate voices. Some of these Pokémon have even gathered a fan base.",
    "It has several different cry patterns, each of which seems to have its own meaning.",
    "Its strange cries sound like human language. There are some musicians who compose songs for Jynx to sing.",
    "In certain parts of Galar, Jynx was once feared and worshiped as the Queen of Ice.",
    "Appears to move to a rhythm of its own, as if it were dancing. It wiggles its hips as it walks.",
    "It speaks using a language that sounds human. Research is under way to determine what is being said."
  ],
  "genera": [
    {
      "genus": "Human Shape Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}