{
  "id": 125,
  "name": "electabuzz",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "electric",
        "url": "https://pokeapi.co/api/v2/type/13/"
      }
    }
  ],
  "flavor_text_entries": [
    "Electricity runs across the surface of its body. In darkness, its entire body glows a whitish blue.",
    "Half of all blackouts occur when this Pokémon appears at power plants and eats electricity.",
    "While it’s often blamed for power outages, the truth is the cause of outages is more often an error on the part of the electric company.",
    "Its body constantly discharges electricity. Get­ ting close to it will make your hair stand on end.",
    "Electricity permeates its body. It swings its arms round and round to charge up electricity before unleashing a punch.",
    "If a major power outage occurs, it is certain that this Pokémon has eaten electricity at a power plant.",
    "When a storm approaches, it competes with others to scale heights that are likely to be stricken by lightning. Some towns use Electabuzz in place of lightning rods.",
    "Electricity leaks from it in amounts far greater than the amount of electricity it eats.",
    "Normally found near power plants, they can wander away and cause major blackouts in cities.",
    "Electricity runs across the surface of its body. In darkness, its entire body glows a whitish-blue.",
    "Many power plants keep Ground-type Pokémon around as a defense against Electabuzz that come seeking electricity.",
    "Its body constantly discharges electricity. Getting close to it will make your hair stand on end.",
    "Research is progressing on storing lightning in Electabuzz so this energy can be used at any time.",
    "Half of all sudden blackouts are caused by Electabuzz gathering at electric power plants and gobbling up electricity.",
    "When two Electabuzz touch, they control the electric currents to communicate their feelings.",
    "It loves to feed on strong electricity. It occasionally appears around large power plants and so on.",
    "Feeds on electrical energy. During sudden showers beneath looming thunderclouds, one can observe Electabuzz scaling tall trees, where the Pokémon will then wait for lightning to strike.",
    "With the coming of a storm, many of these Pokémon will gather under tall trees and sit there waiting for lightning to strike.",
    "It windmills its arms to slightly boost its punches. Foes have been known to escape in the meantime.",
    "When a storm arrives, gangs of this Pokémon compete with each other to scale heights that are likely to be stricken by lightning bolts. Some towns use Electabuzz in place of lightning rods."
  ],
  "genera": [
    {
      "genus": "Electric Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}