{
  "id": 126,
  "name": "magmar",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "fire",
        "url": "https://pokeapi.co/api/v2/type/10/"
      }
    }
  ],
  "flavor_text_entries": [
    "The hotter the place, the better they feel. Magmar in Alola are said to be hardier than those in other areas.",
    "Born in the spout of a volcano, its body is covered by flames that shimmer like the sun.",
    "These Pokémon’s bodies are constantly burning. Magmar are feared as one of the causes behind fires.",
    "It dislikes cold places, so it blows scorching flames to make the environment suitable for itself.",
    "Its body always burns with an orange glow that enables it to hide perfectly among flames.",
    "The fiery surface of its body gives off a wavering, rippling glare that is similar to the sun.",
    "Its entire body is burning. When it breathes, the temperature rises. When it sneezes, flames shoot out!",
    "When angered, it spouts brilliant fire from all over its body. It doesn’t calm down until its opponent has burned to ash.",
    "Found near the mouth of a volcano. This fire-breather’s body temperature is nearly 2,200 degrees Fahrenheit.",
    "When it’s tired, it leaps into the mouth of a volcano and soaks its body in magma to ease its weariness. Its body burns at 2,192 degrees F.",
    "It moves more frequently in hot areas. It can heal itself by dipping its wound into lava.",
    "In battle, it blows out intense flames from all over its body to intimidate its foe. These fiery bursts create heat waves that ignite grass and trees in the area.",
    "When it breathes deeply, heat waves form around its body, making it hard to see clearly.",
    "Legend has it that this Pokémon was born from the crater of a volcano. When wounded, it bathes in lava to heal its body, much as one would soak in a hot spring.",
    "The scorching fire exhaled by Magmar forms heat waves around its body, making it hard to see the Pokémon clearly.",
    "Born in an active volcano. Its body is always cloaked in flames, so it looks like a big ball of fire.",
    "In battle, Magmar blows out intensely hot flames from all over its body to intimidate its opponent. This Pokémon’s fiery bursts create heat waves that ignite grass and trees in its surroundings.",
    "Magmar dispatches its prey with fire. But it regrets this habit once it realizes that it has burned its intended prey to a charred crisp.",
    "Its body always burns with an orange glow that enables it to hide perfectly amidst flames."
  ],
  "genera": [
    {
      "genus": "Spitfire Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}