{
  "id": 128,
  "name": "tauros",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "normal",
        "url": "https://pokeapi.co/api/v2/type/1/"
      }
    }
  ],
  "flavor_text_entries": [
    "These violent Pokémon fight with other mem­ bers of their herd in order to prove their strength.",
    "They live in groups. The one with the longest, thickest, and most-scarred horns is the boss of the herd.",
    "When Tauros begins whipping itself with its tails, it’s a warning that the Pokémon is about to charge with astounding speed.",
    "When it is about to tackle, it whips its body repeatedly with its three long tails.",
    "Although it’s known to be a fierce Pokémon, Tauros in the Alola region are said to possess a measure of calmness.",
    "They fight each other by locking horns. The herd’s protector takes pride in its battle-scarred horns.",
    "The Tauros of the Galar region are volatile in nature, and they won’t allow people to ride on their backs.",
    "When it targets an enemy, it charges furiously while whipping its body with its long tails.",
    "When it is about to TACKLE, it whips its body repeatedly with its three long tails.",
    "After heightening its will to fight by whipping itself with its three tails, it charges at full speed.",
    "They fight each other by locking horns. The herd's protector takes pride in its battle-scarred horns.",
    "The climate seems to be related to the reason Tauros in Alola are a little calmer than those in other regions.",
    "This Pokémon is not satisfied unless it is rampaging at all times. If there is no opponent for Tauros to battle, it will charge at thick trees and knock them down to calm itself.",
    "A rowdy Pokémon with a lot of stamina. Once running, it won't stop until it hits something.",
    "A rowdy Pokémon with a lot of stamina. Once running, it won’t stop until it hits something.",
    "Once it takes aim at its foe, it makes a headlong charge. It is famous for its violent nature.",
    "Historically, people in areas all over the world have ridden Tauros, but the practice is said to have started in Alola.",
    "It is not satisfied unless it is rampaging at all times. If there is no opponent for Tauros to battle, it will charge at thick trees and knock them down to calm itself."
  ],
  "genera": [
    {
      "genus": "Wild Bull Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}