{
  "id": 129,
  "name": "magikarp",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "water",
        "url": "https://pokeapi.co/api/v2/type/11/"
      }
    }
  ],
  "flavor_text_entries": [
    "An underpowered, pathetic Pokémon. It may jump high on rare occasions, but usually not more than seven feet.",
    "It is virtually worthless in terms of both power and speed. It is the most weak and pathetic Pokémon in the world.",
    "Its reckless leaps make it easy pickings for predators. On the bright side, many Pokémon enjoy longer life spans, thanks to Magikarp.",
    "A feeble, pitiful imbecile of a Pokémon that is nonetheless very hardy. Unperturbed by turbid water, it can be found living in all sorts of places.",
    "Its swimming muscles are weak, so it is easily washed away by currents. In places where water pools, you can see many Magikarp deposited there by the flow.",
    "Famous for being very unreliable. It can be found swimming in seas, lakes, rivers, and shallow puddles.",
    "Magikarp is a pathetic excuse for a Pokémon that is only capable of flopping and splashing. This behavior prompted scientists to undertake research into it.",
    "An underpowered, pathetic Pokémon. It may jump high on rare occasions, but never more than seven feet.",
    "In the distant past, they were fairly strong, but they have become gradually weaker over time.",
    "This weak and pathetic Pokémon gets easily pushed along rivers when there are strong currents.",
    "Famous for being very unreliable. It can be found swimming in seas, lakes, rivers and shallow puddles.",
    "Magikarp is virtually useless in battle as it can only splash around. As a result, it is considered to be weak. However, it is actually a very hardy Pokémon that can survive in any body of water no matter how polluted it is.",
    "In the distant past, it was somewhat stronger than the horribly weak descendants that exist today.",
    "It is unable to swim against even slow-moving currents. It always splashes about for some reason.",
    "For no reason, it jumps and splashes about, making it easy for predators like PIDGEOTTO to catch it mid-jump.",
    "Thanks to their strong hold on life, dirty water doesn’t bother them at all. They live in waters all over the world!",
    "A Magikarp living for many years can leap a mountain using Splash. The move remains useless, though.",
    "Although weak and helpless, this Pokémon is incredibly fertile. They exist in such multitudes, you’ll soon grow tired of seeing them.",
    "It is said to be the world’s weakest Pokémon. No one knows why it has managed to survive."
  ],
  "genera": [
    {
      "genus": "Fish Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}