{
  "id": 134,
  "name": "vaporeon",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "water",
        "url": "https://pokeapi.co/api/v2/type/11/"
      }
    }
  ],
  "flavor_text_entries": [
    "Its cell composition is similar to water molecules. As a result, it can’t be seen when it melts away into water.",
    "It prefers beautiful shores. With cells similar to water molecules, it could melt in water.",
    "When Vaporeon's fins begin to vibrate, it is a sign that rain will come within a few hours.",
    "Vaporeon underwent a spontaneous mutation and grew fins and gills that allow them to live underwater. They have the ability to freely control water.",
    "Lives close to water. Its long tail is ridged with a fin which is often mistaken for a mermaid’s.",
    "As it uses the fins on the tip of its tail to swim, it blends with the water perfectly.",
    "Its cells are composed of units much like water molecules. It lives close to water and is often mistaken for a mermaid.",
    "When Vaporeon’s fins begin to vibrate, it is a sign that rain will come within a few hours.",
    "Tests show that its cells closely resemble water molecules, which perhaps explains its ability to conceal its form while submerged. I believe the origins of mermaid folklore lie with this Pokémon.",
    "Its cell structure is similar to water molecules. It melts into the water and becomes invisible.",
    "Its body’s cellular structure is similar to the molecular composition of water. It can melt invisibly in water.",
    "Its cell structure is similar to water molecules. It will melt away and become invisible in water.",
    "Blending in with the water and erasing all signs of its presence, it patiently waits for its prey, fish Pokémon.",
    "It has evolved to be suitable for an aquatic life. It can invisibly melt away into water.",
    "Clean, clear waters are its usual habitat. When it’s about to be attacked by an invading enemy, it dives into the water to hide.",
    "It detects nearby moisture with its fin. When its fin begins trembling rapidly, that means rain will fall in a few hours.",
    "Its cell composition is similar to water molecules. As a result, it can melt away into water.",
    "Lives close to water. Its long tail is ridged with a fin which is often mistaken for a mermaid's.",
    "Vaporeon underwent a spontaneous mutation and grew fins and gills that allow it to live underwater. This Pokémon has the ability to freely control water."
  ],
  "genera": [
    {
      "genus": "Bubble Jet Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}