{
  "id": 138,
  "name": "omanyte",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "rock",
        "url": "https://pokeapi.co/api/v2/type/6/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "water",
        "url": "https://pokeapi.co/api/v2/type/11/"
      }
    }
  ],
  "flavor_text_entries": [
    "This Pokémon from ancient times is said to have navi­ gated the sea by adeptly twisting its 10 tentacles.",
    "A prehistoric Pokémon that lived in the primordial sea, it swims by twisting its 10 tentacles about.",
    "One of the ancient and long-since-extinct Pokémon that have been regenerated from fossils by humans. If attacked, it withdraws into its hard shell.",
    "Omanyte is one of the ancient and long-since-extinct Pokémon that have been regenerated from fossils by people. If attacked by an enemy, it withdraws itself inside its hard shell.",
    "Because some Omanyte manage to escape after being restored or are released into the wild by people, this species is becoming a problem.",
    "Omanyte is one of the ancient and long- since-extinct Pokémon that have been regenerated from fossils by people. If attacked by an enemy, it withdraws itself inside its hard shell.",
    "Omanyte lived in the seas of antiquity. Its fossils have been found bearing bite marks from Archeops, so apparently Archeops preyed on it.",
    "This Pokémon is a member of an ancient, extinct species. Omanyte paddles through water with its 10 tentacles, looking like it’s just drifting along.",
    "It was restored from an ancient fossil. Those Helix Fossils are excavated from areas that were once oceans long, long ago.",
    "Revived from an ancient fossil, this Pokémon uses air stored in its shell to sink and rise in water.",
    "Although long extinct, in rare cases, it can be genetically regenerated from fossils.",
    "An ancient Pokémon that was recovered from a fossil. It swam by cleverly twisting its 10 tentacles about.",
    "In prehistoric times, it swam on the sea floor, eating plankton. Its fossils are sometimes found.",
    "A Pokémon that was resurrected from a fossil using modern science. It swam in ancient seas.",
    "Although long extinct, in rare cases, it can be genetically resurrected from fossils.",
    "This Pokémon from ancient times is said to have navigated the sea by adeptly twisting its 10 tentacles.",
    "An ancient Pokémon that was recovered from a fossil. It swims by cleverly twisting its 10 tentacles about."
  ],
  "genera": [
    {
      "genus": "Spiral Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}