{
  "id": 141,
  "name": "kabutops",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "rock",
        "url": "https://pokeapi.co/api/v2/type/6/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "water",
        "url": "https://pokeapi.co/api/v2/type/11/"
      }
    }
  ],
  "flavor_text_entries": [
    "It swims at speeds of roughly 29 knots, quickly closing in on its prey and slashing into them with its scythes to finish them off.",
    "A slim and fast swimmer. It slices its prey with its sharp sickles and drinks the body fluids.",
    "Its sleek shape is perfect for swimming. It slashes prey with its claws and drains their fluids.",
    "Its sleek shape is perfect for swimming. It slashes prey with its claws and drains the body fluids.",
    "With sharp claws, this ferocious, ancient Pokémon rips apart prey and sucks their body fluids.",
    "Kabutops swam underwater to hunt for its prey in ancient times. The Pokémon was apparently evolving from being a water dweller to living on land as evident from the beginnings of change in its gills and legs.",
    "It swims freely through water. It catches prey with its scythe-like arms and drains the victim’s fluids.",
    "It was able to swim quickly through the water by compactly folding up its razor-sharp sickles.",
    "A slim and fast swimmer. It sliced its prey with its sharp sickles and drank the body fluids.",
    "Kabutops slices its prey apart and sucks out the fluids. The discarded body parts become food for other Pokémon.",
    "Kabutops swam underwater to hunt for its prey in ancient times. The Pokémon was apparently evolving from being a water-dweller to living on land as evident from the beginnings of change in its gills and legs.",
    "Kabutops once swam underwater to hunt  for prey. It was apparently evolving from being a water dweller to living on land as evident from changes in its gills and legs.",
    "Its body had begun to change so it could function on land. But it didn’t adapt in time and went extinct.",
    "The cause behind the extinction of this species is unknown. Kabutops were aggressive Pokémon that inhabited warm seas.",
    "It is thought that this Pokémon came onto land because its prey adapted to life on land.",
    "In the water, it tucks in its limbs to become more compact, then it wiggles its shell to swim fast."
  ],
  "genera": [
    {
      "genus": "Shellfish Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}