{
  "id": 142,
  "name": "aerodactyl",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "rock",
        "url": "https://pokeapi.co/api/v2/type/6/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "flying",
        "url": "https://pokeapi.co/api/v2/type/3/"
      }
    }
  ],
  "flavor_text_entries": [
    "It was regenerated from a dinosaur’s genetic matter that was found in amber. It flies with high-pitched cries.",
    "In prehistoric times, this Pokémon flew freely and fearlessly through the skies.",
    "A Pokémon that roamed the skies in the dinosaur era. Its teeth are like saw blades.",
    "This vicious Pokémon is said to have flown in an­ cient skies while shrieking high- pitched cries.",
    "Aerodactyl is a Pokémon from the age of dinosaurs. It was regenerated from genetic material extracted from amber. It is imagined to have been the king of the skies in ancient times.",
    "Aerodactyl is a Pokémon from the age of dinosaurs. It was regenerated from DNA extracted from amber. It is imagined to have been the king of the skies.",
    "A Pokémon from the age of the dinosaurs. It used its sawlike fangs to shred its prey before eating them.",
    "Restored from DNA found in amber, this Pokémon exhibited ferocity that was greater than expected. Some casualties resulted.",
    "A savage Pokémon that died out in ancient times. It was resurrected using DNA taken from amber.",
    "This is a ferocious Pokémon from ancient times. Apparently even modern technology is incapable of producing a perfectly restored specimen.",
    "In ancient times, it ruled the skies. A widely accepted theory is that it went extinct due to a large meteor impact.",
    "A ferocious, prehistoric Pokémon that goes for the enemy’s throat with its serrated, sawlike fangs.",
    "It flew through the open skies over the ancient continent as if they were its own. When it touched ground, its walk was weak and slow.",
    "A vicious Pokémon from the distant past, it appears to have flown by spreading its wings and gliding.",
    "A ferocious, prehistoric Pokémon that goes for the enemy's throat with its serrated saw-like fangs.",
    "This vicious Pokémon is said to have flown in ancient skies while shrieking high-pitched cries.",
    "Aerodactyl’s sawlike fangs can shred skin to tatters—even the skin of Steel-type Pokémon."
  ],
  "genera": [
    {
      "genus": "Fossil Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}