{
  "id": 146,
  "name": "moltres",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "fire",
        "url": "https://pokeapi.co/api/v2/type/10/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "flying",
        "url": "https://pokeapi.co/api/v2/type/3/"
      }
    }
  ],
  "flavor_text_entries": [
    "Known as the legendary bird of fire. Every flap of its wings creates a dazzling flash of flames.",
    "This legendary bird Pokémon is said to bring early spring to the wintry lands it visits.",
    "Legendary bird Pokémon. It is said to migrate from the south along with the spring.",
    "One of the legendary bird Pokémon. Those seeing it are overwhelmed by its orange wings that seem to be on fire.",
    "One of the legendary bird Pokémon. It is said that its appearance indicates the coming of spring.",
    "There are stories of this Pokémon using its radiant, flame-cloaked wings to light up paths for those lost in the mountains.",
    "Moltres is a legendary bird Pokémon that has the ability to control fire. If this Pokémon is injured, it is said to dip its body in the molten magma of a volcano to burn and heal itself.",
    "This legendary Pokémon scatters embers with every flap of its wings. It is a thrilling sight to behold.",
    "A legendary bird Pokémon. As it flaps its flaming wings, even the night sky will turn red.",
    "Moltres is a legendary bird Pokémon that can control fire. If injured, it is said to dip its body in the molten magma of a volcano to burn and heal itself.",
    "It is said to be the legendary bird Pokémon of fire. Every flap of its wings creates a dazzling flare of flames.",
    "It’s one of the legendary bird Pokémon. When Moltres flaps its flaming wings, they glimmer with a dazzling red glow."
  ],
  "genera": [
    {
      "genus": "Flame Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}