{
  "id": 149,
  "name": "dragonite",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "dragon",
        "url": "https://pokeapi.co/api/v2/type/16/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "flying",
        "url": "https://pokeapi.co/api/v2/type/3/"
      }
    }
  ],
  "flavor_text_entries": [
    "It can fly in spite of its big and bulky physique. It circles the globe in just 16 hours.",
    "This Pokémon is known as the Sea Incarnate. Figureheads that resemble Dragonite decorate the bows of many ships.",
    "It is said that this Pokémon lives somewhere in the sea and that it flies. However, these are only rumors.",
    "You’ll often hear tales of this kindhearted Pokémon rescuing people or Pokémon that are drowning.",
    "Dragonite is capable of circling the globe in just 16 hours. It is a kindhearted Pokémon that leads lost and foundering ships in a storm to the safety of land.",
    "Only a very few people ever see this Pokémon. Its intelligence is said to match that of humans.",
    "It is said to make its home somewhere in the sea. It guides crews of shipwrecks to shore.",
    "It is said that this Pokémon constantly flies over the immense seas and rescues drowning people.",
    "This Pokémon saved a shipwrecked man, taking him to a remote island—a paradise occupied solely by Dragonite.",
    "It can circle the globe in just 16 hours. It is a kindhearted Pokémon that leads lost and foundering ships in a storm to the safety of land.",
    "It flies over raging seas as if they were nothing. Observing this, a ship’s captain dubbed this Pokémon “the sea incarnate. ”",
    "It is said that this Pokémon lives somewhere in the sea and that it flies. However, it is only a rumor.",
    "This marine Pokémon has an impressive build that lets it freely fly over raging seas without trouble.",
    "An extremely rarely seen marine Pokémon. Its intelligence is said to match that of humans.",
    "It’s a kindhearted Pokémon. If it spots a drowning person or Pokémon, Dragonite simply must help them.",
    "Dragonite is capable of circling the globe in just sixteen hours. It is a kindhearted Pokémon that leads lost and foundering ships in a storm to the safety of land.",
    "Incur the wrath of this normally calm Pokémon at your peril, because it will smash everything to smithereens before it’s satisfied.",
    "It is said that somewhere in the ocean lies an island where these gather. Only they live there."
  ],
  "genera": [
    {
      "genus": "Dragon Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}