{
  "id": 166,
  "name": "ledian",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "bug",
        "url": "https://pokeapi.co/api/v2/type/7/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "flying",
        "url": "https://pokeapi.co/api/v2/type/3/"
      }
    }
  ],
  "flavor_text_entries": [
    "It is said that in lands with clean air, where the stars fill the sky, there live Ledian in countless numbers. There is a good reason for this—the Pokémon uses the light of the stars as its energy.",
    "It is said that in lands with clean air, where the stars fill the sky, there live many Ledian. For good reason, they use the light of the stars as energy.",
    "It’s said that the patterns on its back are related to the stars in the night sky, but the details of that relationship remain unclear.",
    "It uses starlight as energy. When more stars appear at night, the patterns on its back grow larger.",
    "The star patterns on its back grow larger or smaller depending on the number of stars in the night sky.",
    "It flies through the night sky, sprinkling sparkly dust. According to some, if that dust sticks to you, good things will happen to you.",
    "In the daytime when it gets warm, it curls up inside a big leaf and drifts off into a deep slumber.",
    "While it’s believed that starlight provides it with energy, this Pokémon also loves to eat berries. In the daytime, it curls up in the grass to sleep.",
    "In battle, it throws punches with all four arms. The power of each individual blow is piddly, so it aims to win by quantity rather than quality.",
    "The spot patterns on its back grow larger or smaller depending on the number of stars in the night sky.",
    "When the stars flicker in the night sky, it flutters about, scattering a glowing powder.",
    "It is said that in lands with clean air, where the stars fill the sky, there live Ledian in countless numbers. There is a good reason for this - the Pokémon uses the light of the stars as its energy."
  ],
  "genera": [
    {
      "genus": "Five Star Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}