{
  "id": 172,
  "name": "pichu",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "electric",
        "url": "https://pokeapi.co/api/v2/type/13/"
      }
    }
  ],
  "flavor_text_entries": [
    "The electric pouches on its cheeks are still small. They cannot store much electricity yet.",
    "It has electric sacs in its cheeks. When they’re fully charged, Pichu plays very energetically.",
    "It is not yet skilled at storing electricity. It may send out a jolt if amused or startled.",
    "It is still inept at retaining electricity. When it is startled, it discharges power accidentally. It gets better at holding power as it grows older.",
    "It still can’t use electricity well. When it’s surprised or excited, it discharges electricity unintentionally.",
    "Pichu charges itself with electricity more easily on days with thunderclouds or when the air is very dry. You can hear the crackling of static electricity coming off this Pokémon.",
    "When Pichu plays with others, it may short out electricity with another Pichu, creating a shower of sparks. In that event, this Pokémon will begin crying, startled by the flash of sparks.",
    "It plays with others by touching tails and setting off sparks. This appears to be a test of courage.",
    "The electric sacs in its cheeks are small. If even a little electricity leaks, it becomes shocked.",
    "It is not yet skilled at controlling electricity. If you take your eyes off it, it may shock itself.",
    "Despite its small size, it can zap even adult humans. However, if it does so, it also surprises itself.",
    "It is unskilled at storing electric power. Any kind of shock causes it to discharge energy spontaneously.",
    "Pichu stores electricity in the sacs on its cheeks but discharges it inadvertently when agitated or excited. Being yet immature, the Pokémon's handling of electricity is rather inept.",
    "Despite this Pokémon’s cute appearance, those who want to live with one should prepare to be on the receiving end of its electric jolts."
  ],
  "genera": [
    {
      "genus": "Tiny Mouse Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}