{
  "id": 173,
  "name": "cleffa",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "fairy",
        "url": "https://pokeapi.co/api/v2/type/18/"
      }
    }
  ],
  "flavor_text_entries": [
    "Many appear when the night skies are filled with shooting stars. They disappear with sunrise.",
    "According to local rumors, Cleffa are often seen in places where shooting stars have fallen.",
    "Said to have ridden here on a shooting star, Cleffa seem to appear in places where meteorites have struck in the past.",
    "When numerous meteors illuminate the night sky, sightings of Cleffa strangely increase.",
    "Because of its unusual, starlike silhouette, people believe that it came here on a meteor.",
    "If the impact site of a meteorite is found, this Pokémon is certain to be within the immediate area.",
    "On nights with many shooting stars, Cleffa can be seen dancing in a ring. They dance until daybreak, when they quench their thirst with the morning dew.",
    "Because of its silhouette, it’s believed to be a star reborn. For some reason, it loves Minior.",
    "It is often seen when shooting stars fill the night skies. It’s said to arrive riding on a shooting star.",
    "Because of its unusual, star-like silhouette, people believe that it came here on a meteor.",
    "In silhouette, they resemble twinkling starlight. When shooting stars rain from the night sky, Cleffa gather in numbers and dance as though they are indeed incarnations of the stars.",
    "On nights with many shooting stars, they gather in packs and dance in circles. If you should see them, something good will happen!",
    "Its silhouette is like a star. It is believed to arrive riding on shooting stars.",
    "On late nights illuminated by shooting stars, it gazes intently skyward, as if thinking of its home.",
    "On nights with many shooting stars, Cleffa can be seen dancing in a ring. They dance through the night and stop only at the break of day, when these Pokémon quench their thirst with the morning dew."
  ],
  "genera": [
    {
      "genus": "Star Shape Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}