{
  "id": 184,
  "name": "azumarill",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "water",
        "url": "https://pokeapi.co/api/v2/type/11/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "fairy",
        "url": "https://pokeapi.co/api/v2/type/18/"
      }
    }
  ],
  "flavor_text_entries": [
    "It lives in water virtually all day long. Its body color and pattern act as camouflage that makes it tough for enemies to spot in water.",
    "Azumarill’s long ears are indispensable sensors. By focusing its hearing, this Pokémon can identify what kinds of prey are around, even in rough and fast-running rivers.",
    "These Pokémon create air-filled bubbles. When Azurill play in rivers, Azumarill will cover them with these bubbles.",
    "Its long ears are superb sensors. It can distinguish the movements of things in water and tell what they are.",
    "By keeping still and listening intently, it can even tell what is in wild, fast-moving rivers.",
    "By keeping still and listening intently, it can tell what is in even wild, fast-moving rivers.",
    "By keeping still and listening intently, it can tell what is in even wild, fast- moving rivers.",
    "The bubble-like pattern on its stomach helps it camouflage itself when it's in the water.",
    "The bubble-like pattern on its stomach helps it camouflage itself when it’s in the water.",
    "Azumarill can make balloons out of air. It makes these air balloons if it spots a drowning Pokémon. The air balloons enable the Pokémon in trouble to breathe.",
    "Its long ears are superb sensors. It can distinguish the movements of living things on riverbeds.",
    "It can spend all day in water, since it can inhale and store a large volume of air.",
    "When it plays in water, it rolls up its elongated ears to prevent their insides from getting wet.",
    "It spends most of its time in the water. On sunny days, Azumarill floats on the surface of the water and sunbathes.",
    "It lives in rivers and lakes. In water, its coloring and patterns trick the vision of foes."
  ],
  "genera": [
    {
      "genus": "Aqua Rabbit Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}