{
  "id": 19,
  "name": "rattata",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "normal",
        "url": "https://pokeapi.co/api/v2/type/1/"
      }
    }
  ],
  "flavor_text_entries": [
    "Bites anything when it attacks. Small and very quick, it is a common sight in many places.",
    "This Pokémon's impressive vitality allows it to live anywhere. It also multiplies very quickly.",
    "This Pokémon is common but hazardous. Its sharp incisors can easily cut right through hard wood.",
    "A Rattata is cautious in the extreme. Even while it is asleep, it constantly moves its ears and listens for danger. It will make its nest anywhere.",
    "Its fangs are long and very sharp. They grow continuously, so it gnaws on hard things to whittle them down.",
    "Rattata is cautious in the extreme. Even while it is asleep, it constantly listens by moving its ears around. It is not picky about where it lives - it will make its nest anywhere.",
    "Cautious in the extreme, its hardy vitality lets it live in any kind of environment.",
    "Its incisors grow continuously throughout its life. If its incisors get too long, this Pokémon becomes unable to eat, and it starves to death.",
    "It eats anything. Wherever food is available, it will settle down and produce offspring continuously.",
    "It searches for food all day. It gnaws on hard objects to wear down its fangs, which grow constantly during its lifetime.",
    "Will chew on anything with its fangs. If you see one, you can be certain that 40 more live in the area.",
    "Its incisors continue growing until its death. If its Trainer doesn’t offer it a file to gnaw on, it will gnaw on door frames, table legs, and so on.",
    "Will chew on anything with its fangs. If you see one, it is certain that 40 more live in the area.",
    "With their strong capacity for survival, they can live in dirty places without concern. Left unchecked, their numbers multiply rapidly.",
    "Living wherever there is food available, it ceaselessly scavenges for edibles the entire day.",
    "Rattata is cautious in the extreme. Even while it is asleep, it constantly listens by moving its ears around. It is not picky about where it lives—it will make its nest anywhere."
  ],
  "genera": [
    {
      "genus": "Mouse Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}