{
  "id": 197,
  "name": "umbreon",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "dark",
        "url": "https://pokeapi.co/api/v2/type/17/"
      }
    }
  ],
  "flavor_text_entries": [
    "This Pokémon is nocturnal. Even in total darkness, its large eyes can spot its prey clearly!",
    "It is most active in the wee hours of the night, when moonlight bathes the land. Its large eyes can pierce the darkness and perceive prey with absolute clarity.",
    "When darkness falls, the rings on its body begin to glow, striking fear in the hearts of anyone nearby.",
    "When agitated, this Pokémon protects itself by spraying poisonous sweat from its pores.",
    "Umbreon evolved as a result of exposure to the moon’s waves. It hides silently in darkness and waits for its foes to make a move. The rings on its body glow when it leaps to attack.",
    "When darkness falls, the rings on the body begin to glow, striking fear in the hearts of anyone nearby.",
    "On the night of a full moon, or when it gets excited, the ring patterns on its body glow yellow.",
    "When this Pokémon becomes angry, its pores secrete a poisonous sweat, which it sprays at its opponent’s eyes.",
    "The light of the moon changed Eevee’s genetic structure. It lurks in darkness for prey.",
    "When exposed to the moon’s aura, the rings on its body glow faintly and it’s filled with a mysterious power.",
    "It lurks in the dark of night looking for prey. At the moment it pounces, the rings on its body glow dimly but ominously.",
    "When exposed to the moon’s aura, the rings on its body glow faintly and it gains a mysterious power.",
    "Umbreon evolved from exposure to the moon’s energy pulses. It lurks in darkness and waits for its foes to move. The rings on its body glow when it leaps to attack.",
    "With its black fur, it blends into the darkness. It bides its time, and when prey appears, this Pokémon goes for its throat, and then eats it.",
    "The light of the moon changed EEVEE’s genetic structure. It lurks in darkness for prey."
  ],
  "genera": [
    {
      "genus": "Moonlight Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}