{
  "id": 198,
  "name": "murkrow",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "dark",
        "url": "https://pokeapi.co/api/v2/type/17/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "flying",
        "url": "https://pokeapi.co/api/v2/type/3/"
      }
    }
  ],
  "flavor_text_entries": [
    "Feared and loathed by many, it is believed to bring misfortune to all those who see it at night.",
    "It appears near travelers to lure them into deep forests. It is said to carry misfortune.",
    "Murkrow were feared as the alleged bearers of ill fortune. It shows strong interest in anything that sparkles. It will even try to steal rings from women.",
    "It is believed that seeing this Pokémon at night will bring about ominous occurrences.",
    "Murkrow was feared and loathed as the alleged bearer of ill fortune. This Pokémon shows strong interest in anything that sparkles or glitters. It will even try to steal rings from women.",
    "It hides any shiny object it finds in a secret location. Murkrow and Meowth loot one another’s stashes.",
    "Seen as a symbol of bad luck, it’s generally disliked. Yet it gives presents—objects that sparkle or shine—to Trainers it’s close to.",
    "It hides any shiny object it finds in a secret location. Murkrow and MEOWTH loot one another's stashes.",
    "If spotted, it will lure an unwary person into chasing it then lose the pursuer on mountain trails.",
    "Widely shunned as a bearer of ill fortune. Upon crossing paths with this creature, I've been told one must chant ”Workrum, Workrum—bad luck, don't come” as a protective incantation.",
    "It searches for shiny things for its boss. Murkrow’s presence is said to be unlucky, so many people detest it.",
    "It is said that when chased, it lures its attacker onto dark mountain trails where the foe will get lost.",
    "If spotted, it will lure an unwary person into chasing it, then lose the pursuer on mountain trails.",
    "They awaken at dusk and take wing in the twilight, leading to the expression, “Get home before the Murkrow fly. ”",
    "It has a weakness for shiny things. It’s been known to sneak into the nests of Gabite—noted collectors of jewels—in search of treasure."
  ],
  "genera": [
    {
      "genus": "Darkness Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}