{
  "id": 199,
  "name": "slowking",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "water",
        "url": "https://pokeapi.co/api/v2/type/11/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "psychic",
        "url": "https://pokeapi.co/api/v2/type/14/"
      }
    }
  ],
  "flavor_text_entries": [
    "Slowking undertakes research every day in an effort to solve the mysteries of the world. However, this Pokémon apparently forgets everything it has learned if the SHELLDER on its head comes off.",
    "Being bitten by SHELLDER gave it intelligence comparable to that of award-winning scientists.",
    "Slowking undertakes research every day in an effort to solve the mysteries of the world. However, this Pokémon apparently forgets everything it has learned if the Shellder on its head comes off.",
    "When its head was bitten, toxins entered SLOWPOKE's head and unlocked an extraordinary power.",
    "When its head was bitten, toxins entered Slowpoke’s head and unlocked an extraordinary power.",
    "A poisonous bite reacted with its system, blessing it with the enhanced intellect of a genius. It has full control of its psychic powers.",
    "It has incredible intellect and intuition. Whatever the situation, it remains calm and collected.",
    "Every time it yawns, SHELLDER injects more poi­ son into it. The poison makes it more intelligent.",
    "This Pokémon is so famed for its intellect that a proverb still persists in some regions: “When in doubt, ask Slowking. ”",
    "Being bitten by Shellder gave it intelligence comparable to that of award-winning scientists.",
    "Slowking can solve any problem presented to it, but no one can understand a thing Slowking says.",
    "It’s called “the sage of the sea. ” It engages in battles of wits with Oranguru, but the result is usually a draw.",
    "It undertakes research every day to solve the mysteries of the world. However, it apparently forgets everything if the SHELLDER on its head comes off.",
    "It’s constantly coming up with new ideas that would change the world, but as soon as it hits upon a new idea, it forgets it.",
    "When its head was bitten, toxins entered SLOWPOKE’s head and unlocked an extraordinary power.",
    "Miraculously, this former Slowpoke’s latent intelligence was drawn out when Shellder poison raced through its brain."
  ],
  "genera": [
    {
      "genus": "Royal Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}