{
  "id": 20,
  "name": "raticate",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "normal",
        "url": "https://pokeapi.co/api/v2/type/1/"
      }
    }
  ],
  "flavor_text_entries": [
    "It uses its whiskers to maintain its balance. It apparently slows down if they are cut off.",
    "Its rear feet have three toes each. They are webbed, enabling it to swim across rivers.",
    "Its disposition is far more violent than its looks would suggest. Don’t let your hand get too close to its face, as it could bite your hand clean off.",
    "Its whiskers help it to maintain balance. Its fangs never stop growing, so it gnaws to pare them down.",
    "A Raticate’s sturdy fangs grow steadily. To keep them ground down, it gnaws on rocks and logs. It may even chew on the walls of houses.",
    "Gnaws on anything with its tough fangs. It can even topple concrete buildings by gnawing on them.",
    "With its long fangs, this surprisingly violent Pokémon can gnaw away even thick concrete with ease.",
    "It whittles its constantly growing fangs by gnawing on hard things. It can chew apart cinder walls.",
    "People say that it fled from its enemies by using its small webbed hind feet to swim from island to island in Alola.",
    "Its hind feet are webbed, so it’s a strong swimmer. It can cross rivers and sometimes even oceans.",
    "Its hind feet are webbed. They act as flippers, so it can swim in rivers and hunt for prey.",
    "Its whiskers are essential for maintaining its balance. No matter how friendly you are, it will get angry and bite you if you touch its whiskers.",
    "The webs on its hind legs enable it to cross rivers. It searches wide areas for food.",
    "Raticate’s sturdy fangs grow steadily. To keep them ground down, it gnaws on rocks and logs. It may even chew on the walls of houses."
  ],
  "genera": [
    {
      "genus": "Mouse Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}