{
  "id": 200,
  "name": "misdreavus",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "ghost",
        "url": "https://pokeapi.co/api/v2/type/8/"
      }
    }
  ],
  "flavor_text_entries": [
    "It loves to bite and yank people's hair from behind without warning, just to see their shocked reactions.",
    "It will use any means necessary to frighten people and absorb their life energy. It practices constantly to hone its skill in causing fear.",
    "It likes playing mischievous tricks such as screaming and wailing to startle people at night.",
    "A Misdreavus frightens people with a creepy, sobbing cry. It apparently uses its red spheres to absorb the fear of foes as its nutrition.",
    "It loves to sneak up on people late at night, then startle them with its shrieklike cry.",
    "What gives meaning to its life is surprising others. If you set your ear against the red orbs around its neck, you can hear shrieking.",
    "It loves to bite and yank people’s hair from behind without warning, just to see their shocked reactions.",
    "It likes playing mischievous tricks such as screaming and wailing to startle people at night. ",
    "It likes playing mischievous tricks, such as screaming and wailing to startle people at night.",
    "A Pokémon that startles people in the middle of the night. It gathers fear as its energy.",
    "It conceals itself in darkness, sending chills up travelers' spines with its childlike weeping. As it observes the frightened travelers with glee, the red orbs upon its chest let off an eerie light.",
    "It gets nourishment from fear that it absorbs into its red orbs. In daytime, it sleeps in darkness.",
    "Misdreavus frightens people with a creepy, sobbing cry. The Pokémon apparently uses its red spheres to absorb the fearful feelings of foes and turn them into nutrition.",
    "It loves to watch people it's scared. It frightens them by screaming loudly or appearing suddenly.",
    "What makes it happy is imitating the voices of weeping people and scaring everyone. It doesn’t deal well with folks who aren’t easily frightened.",
    "If you hear a sobbing sound emanating from a vacant room, it’s undoubtedly a bit of mischief from Misdreavus."
  ],
  "genera": [
    {
      "genus": "Screech Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}