{
  "id": 21,
  "name": "spearow",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "normal",
        "url": "https://pokeapi.co/api/v2/type/1/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "flying",
        "url": "https://pokeapi.co/api/v2/type/3/"
      }
    }
  ],
  "flavor_text_entries": [
    "Eats bugs in grassy areas. It has to flap its short wings at high speed to stay airborne.",
    "Its loud cry can be heard over half a mile away. If its high, keening cry is heard echoing all around, it is a sign that they are warning each other of danger.",
    "Spearow has a very loud cry that can be heard over half a mile away. If its high, keening cry is heard echoing all around, it is a sign that they are warning each other of danger.",
    "Its short wings make it inept at flying. It moves about hurriedly and pecks at Bug-type Pokémon in the tall grass.",
    "Farmers whose fields are troubled by bug Pokémon appreciate Spearow for its vigorous appetite and look after it.",
    "It busily flits around here and there. Even if it is frail, it can be a tough foe that uses MIRROR MOVE.",
    "Very protective of its territory, it flaps its short wings busily to dart around at high speed.",
    "It flaps its short wings to flush out insects from tall grass. It then plucks them with its stubby beak.",
    "It flaps its small wings busily to fly. Using its beak, it searches in grass for prey.",
    "To protect its territory, it flies around ceaselessly, making high- pitched cries.",
    "Inept at flying high. However, it can fly around very fast to protect its territory.",
    "Due to its short wings, it can’t fly long distances. It wanders about restlessly and pecks at bug Pokémon.",
    "Its reckless nature leads it to stand up to others—even large Pokémon—if it has to protect its territory."
  ],
  "genera": [
    {
      "genus": "Tiny Bird Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}