{
  "id": 210,
  "name": "granbull",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "fairy",
        "url": "https://pokeapi.co/api/v2/type/18/"
      }
    }
  ],
  "flavor_text_entries": [
    "Because its fangs are too heavy, it always keeps its head tilted down. However, its bite is powerful.",
    "It has a particularly well-developed lower jaw. The huge fangs are heavy, causing it to tilt its head. Unless it is startled, it will not try to bite.",
    "It is timid in spite of its looks. If it becomes enraged, however, it will strike with its huge fangs.",
    "Granbull has a particularly well- developed lower jaw. The enormous fangs are heavy, causing the Pokémon to tip its head back for balance. Unless it is startled, it will not try to bite indiscriminately.",
    "Its well-developed lower jaw and heavy fangs are its weapons. As long as it’s not provoked, it rarely bites.",
    "Although it’s popular with young people, Granbull is timid and sensitive, so it’s totally incompetent as a watchdog.",
    "Because its fangs are too heavy, it always keeps its head tilted down. However, its BITE is powerful.",
    "More timid than Snubbull, this Pokémon is doted on by young people amused at the contrast between its looks and its attitude.",
    "It is actually timid and easily spooked. If attacked, it flails about to fend off its attacker.",
    "It is actually timid and easily spooked. If at­ tacked, it flails about to fend off its attacker.",
    "Granbull has a particularly well-developed lower jaw. The enormous fangs are heavy, causing the Pokémon to tip its head back for balance. Unless it is startled, it will not try to bite indiscriminately.",
    "While it has powerful jaws, it doesn’t care for disputes, so it rarely has a chance to display their might.",
    "It can make most any Pokémon run away simply by opening its mouth wide to reveal its big fangs."
  ],
  "genera": [
    {
      "genus": "Fairy Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}