{
  "id": 214,
  "name": "heracross",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "bug",
        "url": "https://pokeapi.co/api/v2/type/7/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "fighting",
        "url": "https://pokeapi.co/api/v2/type/2/"
      }
    }
  ],
  "flavor_text_entries": [
    "With its Herculean powers, it can easily throw arou­ nd an object that is 100 times its own weight.",
    "No matter how heavy its opponents, it flings them far away with its prized horn.",
    "This powerful Pokémon thrusts its prized horn under its enemies’ bellies then lifts and throws them.",
    "Heracross has sharp claws on its feet. These are planted firmly into the ground or the bark of a tree, giving the Pokémon a secure and solid footing to forcefully fling away foes with its proud horn.",
    "It loves sweet honey. To keep all the honey to itself, it hurls rivals away with its prized horn.",
    "It roams through forests searching for sweet nectar. Although it boasts fantastic physical strength, it’s not that good at flying.",
    "Heracross loves sweet sap and will go looking through forests for it. The Pokémon uses its two antennae to pick up scents as it searches.",
    "It’s proud of its thick horn. In Alola, its biggest rival is Vikavolt, which it’s always fighting with.",
    "This Pokémon has an unparalleled horn. Heracross itself demonstrates tremendous power—it's capable of throwing several people trained in the traditional arts of war at once.",
    "Heracross charges in a straight line at its foe, slips beneath the foe’s grasp, and then scoops up and hurls the opponent with its mighty horn. This Pokémon even has enough power to topple a massive tree.",
    "Usually docile, but if disturbed while sipping honey, it chases off the intruder with its horn.",
    "This powerful Pokémon thrusts its prized horn under its enemies’ bellies, then lifts and throws them.",
    "With its Herculean powers, it can easily throw around an object that is 100 times its own weight.",
    "They gather in forests seeking the sweet sap of trees. It is completely clad in a steel-hard shell. It is proud of its horn, which it uses to fling foes.",
    "It is usually docile, but if it is disturbed while sipping honey, it chases off the intruder with its horn.",
    "With powerful legs and claws, it generates enough power to hurl foes over great distances.",
    "This Pokémon takes pride in its strength, which allows it to lift things 100 times heavier than itself with no trouble at all.",
    "It gathers in forests to search for tree sap, its favorite food. It’s strong enough to hurl foes."
  ],
  "genera": [
    {
      "genus": "Single Horn Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}