{
  "id": 215,
  "name": "sneasel",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "dark",
        "url": "https://pokeapi.co/api/v2/type/17/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "ice",
        "url": "https://pokeapi.co/api/v2/type/15/"
      }
    }
  ],
  "flavor_text_entries": [
    "It uses its claws to poke holes in eggs so it can slurp out the insides. Breeders consider it a scourge and will drive it away or eradicate it.",
    "It is extremely vicious and will not stop attacking until its foe is incapable of moving.",
    "A smart and sneaky Pokémon, it makes its opponents flinch by suddenly showing the claws hidden in its paws.",
    "Its sturdy, curved claws are ideal for traversing precipitous cliffs. From the tips of these claws drips a venom that infiltrates the nerves of any prey caught in Sneasel's grasp.",
    "It feeds on eggs stolen from nests. Its sharply hooked claws rip vulnerable spots on prey.",
    "A Sneasel scales trees by punching its hooked claws into the bark. It seeks out unguarded nests and steals eggs for food while the parents are away.",
    "It blends into the dark of night to ambush its prey. Sneasel will attack Sandshrew, but its hard skin can cause Sneasel’s claws to snap off.",
    "Its paws conceal sharp claws. If attacked, it suddenly extends the claws and startles its enemy.",
    "They will cooperate to steal eggs from the nests of bird Pokémon, but fights break out to determine which one gets to eat the eggs.",
    "This cunning Pokémon hides under the cover of darkness, waiting to attack its prey.",
    "It has a cunning yet savage disposition. It waits for parents to leave their nests, and then it sneaks in to steal their eggs.",
    "Its paws conceal sharp claws. If attacked, it sud­ denly extends the claws and startles its enemy.",
    "A smart and sneaky Pokémon. A pair may work together to steal eggs by having one lure the parents away.",
    "Sneasel scales trees by punching its hooked claws into the bark. This Pokémon seeks out unguarded nests and steals eggs for food while the parents are away.",
    "Vicious in nature, it drives PIDGEY from their nests and feasts on the eggs that are left behind.",
    "Vicious in nature, it drives PIDGEY from their nests and scavenges any leftovers it can find."
  ],
  "genera": [
    {
      "genus": "Sharp Claw Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}