{
  "id": 22,
  "name": "fearow",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "normal",
        "url": "https://pokeapi.co/api/v2/type/1/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "flying",
        "url": "https://pokeapi.co/api/v2/type/3/"
      }
    }
  ],
  "flavor_text_entries": [
    "It uses its long beak to attack. It has a surprisingly long reach, so it must be treated with caution.",
    "It shoots itself suddenly high into the sky, then plummets down in one fell swoop to strike its prey.",
    "A Pokémon that dates back many years. If it senses danger, it flies high and away, instantly.",
    "It has the stamina to keep flying all day on its broad wings. It fights by using its sharp beak.",
    "In Alola, fish Pokémon are its prey. It can be seen circling above the ocean searching for food.",
    "Drawings of a Pokémon resembling Fearow can be seen in murals from deep in ancient history.",
    "Fearow is recognized by its long neck and elongated beak. They are conveniently shaped for catching prey in soil or water. It deftly moves its long and skinny beak to pluck prey.",
    "With its huge and magnificent wings, it can keep aloft without ever having to land for rest.",
    "It’s tough and has excellent stamina. It has no problem flying continuously for a whole day carrying a heavy load.",
    "Its huge and magnificent wings can keep it aloft in the sky. It can remain flying a whole day without landing.",
    "It has the stamina to fly all day on its broad wings. It fights by using its sharp beak.",
    "Carrying food through Fearow’s territory is dangerous. It will snatch the food away from you in a flash!",
    "It cleverly uses its thin, long beak to pluck and eat small insects that hide under the ground.",
    "Its long neck and elongated beak are ideal for catching prey in soil or water. It deftly moves this extended and skinny beak to pluck prey."
  ],
  "genera": [
    {
      "genus": "Beak Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}