{
  "id": 222,
  "name": "corsola",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "water",
        "url": "https://pokeapi.co/api/v2/type/11/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "rock",
        "url": "https://pokeapi.co/api/v2/type/6/"
      }
    }
  ],
  "flavor_text_entries": [
    "Corsola’s branches glitter very beautifully in seven colors when they catch sunlight. If any branch breaks off, this Pokémon grows it back in just one night.",
    "It will regrow any branches that break off its head. People keep particularly beautiful Corsola branches as charms to promote safe childbirth.",
    "Corsola live in warm southern seas. If the sea becomes polluted, the beautiful coral stalks become discolored and crumble away in tatters.",
    "These Pokémon live in warm seas. In prehistoric times, many lived in the oceans around the Galar region as well.",
    "It continuously sheds and grows. The tip of its head is prized as a treasure because of its beauty.",
    "In a south sea nation, the people live in communi­ ties that are built on groups of these Pokémon.",
    "Pursued by Mareanie for the branches on its head, this Pokémon will sometimes snap its own branches off as a diversion while it escapes.",
    "It continuously sheds and grows. The tip of its head is prized as a treasure for its beauty.",
    "In a south-sea nation, the people live in communities that are built on groups of these Pokémon.",
    "In Alola, where their natural enemies Mareanie are plentiful, many Corsola have stubby branches on their heads.",
    "Clusters of Corsola congregate in warm seas where they serve as ideal hiding places for smaller Pokémon. When the water temperature falls, this Pokémon migrates to the southern seas.",
    "The points on its head absorb nutrients from clean water. They cannot survive in polluted water.",
    "The pink of Corsola that live in Alola is deep and vibrant, thanks to seas filled with nutrition.",
    "In a south sea nation, the people live in communities that are built on groups of these Pokémon.",
    "They prefer unpolluted southern seas. Their coral branches lose their color and deteriorate in dirty water.",
    "Coral branches grow from its head. They break off quite easily, but they grow back in about three days.",
    "Many live in the clean seas of the south. They apparently can’t live in polluted waters."
  ],
  "genera": [
    {
      "genus": "Coral Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}