{
  "id": 223,
  "name": "remoraid",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "water",
        "url": "https://pokeapi.co/api/v2/type/11/"
      }
    }
  ],
  "flavor_text_entries": [
    "Using its dorsal fin as a suction pad, it clings to a MANTINE's underside to scavenge for leftovers.",
    "Remoraid sucks in water, then expels it at high velocity using its abdominal muscles to shoot down flying prey. When evolution draws near, this Pokémon travels downstream from rivers.",
    "It has superb accuracy. The water it shoots out can strike even moving prey from more than 300 feet.",
    "It has superb accuracy. The water it shoots out can strike moving prey from more than 300 feet away.",
    "Also known as the “sniper of the seas,” its water gun can hit prey without fail from over 300 feet away.",
    "The water they shoot from their mouths can hit moving prey from more than 300 feet away.",
    "It has superb accuracy. The water it shoots out can strike even moving prey from more than 100 yards.",
    "A Remoraid uses its abdominal muscles to forcefully expel swallowed water, then shoot down flying prey. When evolution approaches, it travels down rivers.",
    "Using its dorsal fin as a suction pad, it clings to a Mantine’s underside to scavenge for leftovers.",
    "This Pokémon clings to Mantine and shares in its prosperity. When its Mantine is attacked, Remoraid will fight alongside it!",
    "To escape from an attacker, it may shoot water out of its mouth, then use that force to swim backward.",
    "It clings to MANTINE to feed on the big Pokémon’s scraps. This is an adaptation to avoid foes.",
    "It forcefully squirts water. The water jet never misses prey even if the Remoraid is deep in the sea.",
    "Spits water from its mouth with incredible accuracy. It captures Burmy by shooting them down off the branches from which they dangle.",
    "Using its dorsal fin as a suction pad, it clings to a MANTINE’s underside to scavenge for leftovers.",
    "It squirts water forcefully from its mouth to shoot down flying prey."
  ],
  "genera": [
    {
      "genus": "Jet Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}