{
  "id": 224,
  "name": "octillery",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "water",
        "url": "https://pokeapi.co/api/v2/type/11/"
      }
    }
  ],
  "flavor_text_entries": [
    "It traps enemies with its suction-cupped tentacles, then smashes them with its rock-hard head.",
    "It lives in the gaps of boulders and in holes on the seafloor. Its suction cups grip prey tightly.",
    "It obscures its foe’s vision by spitting a cloud of murky ink. It makes its nest among boulders.",
    "It traps enemies with its suction- cupped tentacles then smashes them with its rock-hard head.",
    "It traps foes with the suction cups on its tentacles, then smashes them with its rock-hard head.",
    "It loves to lurk inside holes in rocks. It sometimes sprays ink on prey by sticking out only its mouth.",
    "Its instinct is to bury itself in holes. It often steals the nesting holes of others to sleep in them.",
    "While Octillery still shoots water from its mouth, the drastic anatomical difference between it and Remoraid meant that for a long time, no one believed the former evolved from the latter.",
    "It usually sleeps in caves. The pitch-black ink that Octillery spits is also used for cooking.",
    "Octillery grabs onto its foe using its tentacles. This Pokémon tries to immobilize it before delivering the finishing blow. If the foe turns out to be too strong, Octillery spews ink to escape.",
    "It instinctively sneaks into rocky holes. If it gets sleepy, it steals the nest of a fellow Octillery.",
    "The ink it spits when escaping is special. It contains a substance that dulls the sense of smell, so Pokémon with keen noses get lost.",
    "It has a tendency to want to be in holes. It prefers rock crags or pots and sprays ink from them before attacking.",
    "It ensnares its foe with its suction- cupped tentacles before delivering the finishing blow. If the foe turns out to be too strong, it spews ink to escape."
  ],
  "genera": [
    {
      "genus": "Jet Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}