{
  "id": 225,
  "name": "delibird",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "ice",
        "url": "https://pokeapi.co/api/v2/type/15/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "flying",
        "url": "https://pokeapi.co/api/v2/type/3/"
      }
    }
  ],
  "flavor_text_entries": [
    "Although it naturally prefers colder locales, Delibird in Alola seem able to withstand the heat to a certain extent.",
    "It carries food all day long. There are tales about lost people who were saved by its stored food.",
    "It carries food bundled up in its tail. There was a famous explorer who managed to scale Mt. Everest thanks to a Delibird sharing its food.",
    "It always carries its food with it, wherever it goes. If attacked, it throws its food at the opponent.",
    "It carries food all day long. When someone is lost in the mountains, it shares that food.",
    "It nests at the edge of sharp cliffs. It spends all day carrying food to its awaiting chicks.",
    "Delibird carries its food bundled up in its tail. There once was a famous explorer who managed to reach the peak of the world’s highest mountain, thanks to one of these Pokémon sharing its food.",
    "It carries food all day long. There are tales about lost people who were saved by the food it had.",
    "It wraps food in its tail to carry it around. The Delibird with the biggest tail is the boss of the flock!",
    "It shares its food with people who are stranded. Because Delibird is omnivorous, sometimes it gives those people bug Pokémon.",
    "It has a generous habit of sharing its food with people and Pokémon, so it’s always scrounging around for more food.",
    "It carries food rolled up in its tail. It has the habit of sharing food with people lost in mountains.",
    "Delibird carries its food bundled up in its tail. There once was a famous explorer who managed to reach the peak of Mt. Everest thanks to one of these Pokémon sharing its food."
  ],
  "genera": [
    {
      "genus": "Delivery Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}