{
  "id": 227,
  "name": "skarmory",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "steel",
        "url": "https://pokeapi.co/api/v2/type/9/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "flying",
        "url": "https://pokeapi.co/api/v2/type/3/"
      }
    }
  ],
  "flavor_text_entries": [
    "Its body is draped in steel armor. It looks heavy, but it can fly at speeds of up to 185 miles an hour!",
    "Skarmory’s steel wings become tattered and bashed in from repeated battles. Once a year, the battered wings grow back completely, restoring the cutting edges to their pristine state.",
    "Its feathers, which fall off as it grows, are thin and sharp. In times long past, warriors used them as swords.",
    "Skarmory is entirely encased in hard, protective armor. This Pokémon flies at close to 190 mph. It slashes foes with its wings that possess swordlike cutting edges.",
    "People fashion swords from Skarmory’s shed feathers, so this Pokémon is a popular element in heraldic designs.",
    "The feathers that it sheds are very sharp. It is said that people once used the feathers as swords.",
    "Despite being clad entirely in iron-hard armor, it flies at speeds over 180 mph.",
    "Its sturdy wings look heavy, but they are actually hollow and light, allowing it to fly freely in the sky.",
    "The pointed feathers of these Pokémon are sharper than swords. Skarmory and Corviknight fight viciously over territory.",
    "After nesting in bramble bushes, the wings of its chicks grow hard from scratches by thorns.",
    "Its heavy-looking iron body is actually thin and light, so it can fly at speeds over 180 mph.",
    "Its metal body is sturdy, but it does rust rather easily. So on rainy days, this Pokémon prefers to stay put in its nest.",
    "The wing feathers it sheds can be processed and made into knives whose sharpness is recognized by the finest chefs.",
    "A Pokémon that has a body and wings of steel. People in the past used feathers fallen from Skarmory to make swords and knives.",
    "Its sturdy wings look heavy, but its bones are hollow and light, allowing it to fly freely in the sky."
  ],
  "genera": [
    {
      "genus": "Armor Bird Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}