{
  "id": 233,
  "name": "porygon2",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "normal",
        "url": "https://pokeapi.co/api/v2/type/1/"
      }
    }
  ],
  "flavor_text_entries": [
    "This upgraded version of PORYGON is designed for space exploration. However, it can’t even fly.",
    "This upgraded version of PORYGON is designed for space exploration. It can't fly, though.",
    "This is a Porygon that was updated with special data. Porygon2 develops itself by learning about many different subjects all on its own.",
    "Further research enhanced its  abilities. Sometimes, it may exhibit motions that were not programmed.",
    "It was created by humans using the power of science. It has been given artificial intelligence that enables it to learn new gestures and emotions on its own.",
    "After artificial intelligence was implemented in Porygon2, the Pokémon began using a strange language that only other Porygon2 understand.",
    "Even though it doesn’t die in the vacuum of space, it can’t move around very well in zero gravity.",
    "It was upgraded to enable the exploration of other planets. However, it failed to measure up.",
    "Porygon was updated to a new version in readiness for planetary development. But that dream remains unrealized as yet.",
    "For the purposes of planetary development, Porygon was updated with the most cutting-edge technology available.",
    "With planetary development software installed, it became capable of working in space.",
    "AI has been installed in it. It learns various things all on its own, but it even remembers things it doesn’t need to know.",
    "This upgraded version of PORYGON is designed for space exploration. It can’t fly, however.",
    "A bizarre item caused this Pokémon to evolve. While it now exhibits many new gestures and expressions, its biology remains inscrutable.",
    "This manmade Pokémon evolved from the latest technology. It may have unprogrammed reactions.",
    "Further research enhanced its abilities. Sometimes, it may exhibit motions that were not programmed.",
    "Porygon2 was created by humans using the power of science. The man-made Pokémon has been endowed with artificial intelligence that enables it to learn new gestures and emotions on its own."
  ],
  "genera": [
    {
      "genus": "Virtual Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}