{
  "id": 239,
  "name": "elekid",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "electric",
        "url": "https://pokeapi.co/api/v2/type/13/"
      }
    }
  ],
  "flavor_text_entries": [
    "They generate electricity by spinning their arms. During a thunderstorm, if one hears the lively voices of children out in the wilderness, what one is actually hearing are the voices of Elekid.",
    "Even in the most vicious storm, this Pokémon plays happily if thunder rumbles in the sky.",
    "It generates electricity by whirling its arms. However, it can’t store the energy it makes.",
    "When it’s in a house, electrical outlets serve as its baby bottles. It sucks down electricity.",
    "Elekid stores electricity in its body. If it touches metal and accidentally discharges all its built-up electricity, this Pokémon begins swinging its arms in circles to recharge itself.",
    "It rotates its arms to generate electricity, but it tires easily, so it charges up only a little bit.",
    "If it touches metal and discharges the electricity it has stored in its body, an Elekid begins swinging its arms in circles to recharge itself.",
    "It loves violent thunder. The space between its horns flickers bluish- white when it is charging energy.",
    "Spinning its arms around to generate electricity makes the area between its horns shine light blue.",
    "This Pokémon is constantly fighting with Togedemaru that try to steal its electricity. It’s a pretty even match.",
    "When its horns shine a bluish white, that’s the sign it’s fully charged. You’ll get a shocking jolt if you touch it!",
    "When a storm approaches, this Pokémon gets restless. Once Elekid hears the sound of thunder, it gets full-on rowdy.",
    "When it hears the crash of thunder, Elekid’s mood improves. It can be useful to record that sound and play it when Elekid’s feeling down.",
    "It rotates its arms to generate electricity, but it tires easily, so it only charges up a little bit.",
    "It’s not good at storing electricity yet. This Pokémon sneaks into people’s homes, looking for electrical outlets to eat electricity from.",
    "A weak electric current flows between its horns. Sticking a hand there shocks the unwary."
  ],
  "genera": [
    {
      "genus": "Electric Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}