{
  "id": 240,
  "name": "magby",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "fire",
        "url": "https://pokeapi.co/api/v2/type/10/"
      }
    }
  ],
  "flavor_text_entries": [
    "If a Magby is spouting yellow flames from its mouth, it is in good health. When it is fatigued, black smoke will be mixed in with the flames.",
    "It naturally spits an 1100-degree flame. It is said when many appear, it heralds a volcanic eruption.",
    "This Pokémon makes its home near volcanoes. At the end of the day, Magby soaks in magma, resting and recovering from the day’s fatigue.",
    "Each and every time it inhales and exhales, hot embers dribble out of its mouth and nostrils.",
    "It is found in volcanic craters. Its body heat exceeds 1,100 degrees Fahrenheit, so don’t underestimate it.",
    "Many of these Pokémon can be seen in areas with volcanic activity. Feeding can get them so excited, they exhale flames of 1,100 degrees F.",
    "Magby’s state of health is determined by observing the fire it breathes. If the Pokémon is spouting yellow flames from its mouth, it is in good health. When it is fatigued, black smoke will be mixed in with the flames.",
    "It’s small, but its body temperature is over 1,100 degrees Fahrenheit. Embers escape its mouth and nose when it breathes.",
    "It is found in volcanic craters. Its body temp. is over 1100 degrees, so don't underestimate it.",
    "Its body temperature is around 1,100 degrees F. It is healthy if it is breathing yellow flames.",
    "It’s small, but its body temperature is over 1,100 degrees F. Embers escape its mouth and nose when it breathes.",
    "Its magma-like blood circulates throughout its body. Its body’s heat can top 1,100 degrees Fahrenheit.",
    "This Pokémon is still small and timid. Whenever Magby gets excited or surprised, flames leak from its mouth and its nose.",
    "This Pokémon lives in volcanic areas. With each breath, sparks spurt from its mouth and nose. When Magby is in good health, its flames gain a yellow tint.",
    "It is found in volcanic craters. Its body temperature is over 1,100 degrees Fahrenheit, so don’t underestimate it.",
    "Its magma-like blood circulates throughout its body. Its body’s heat can top 1,100 degrees F.",
    "Each and every time it inhales and exhales, hot embers dribble from its mouth and nostrils.",
    "When flames drip from its nose, that means it has a cold. Have it lie down for a nice rest in some magma.",
    "A famous potter lives with a Magby. Apparently its soft flames produce fine works.",
    "Its body temperature is always around 1,100 degrees Fahrenheit. If Magby falls into a small- enough pond, the whole thing will dry up."
  ],
  "genera": [
    {
      "genus": "Live Coal Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}