{
  "id": 241,
  "name": "miltank",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "normal",
        "url": "https://pokeapi.co/api/v2/type/1/"
      }
    }
  ],
  "flavor_text_entries": [
    "Most people raise it for its milk, but it’s quite tough and strong, so it’s also well suited for battle.",
    "If it has just had a baby, the milk it produces con­ tains much more nutrition than usual.",
    "In order to milk a Miltank, one must have a knack for rhythmically pulling up and down on its udders.",
    "It is said that kids who drink Miltank’s milk grow up to become hearty, healthy adults.",
    "This Pokémon needs to be milked every day, or else it will fall ill. The flavor of Miltank milk changes with the seasons.",
    "Its milk is high in calories and packed with nutrients. Therefore, if you drink too much of it, you may wind up with a body like Miltank’s.",
    "If it has just had a baby, the milk it produces contains much more nutrition than usual.",
    "It produces over five gallons of milk a day. The higher the quality of the pastures it lives in, the richer and tastier its milk becomes.",
    "Its milk is packed with nutrition, making it the ultimate beverage for the sick or weary.",
    "Miltank produces highly nutritious milk, so it’s been supporting the lives of people and other Pokémon since ancient times.",
    "It gives over five gallons of milk daily. Its sweet milk is enjoyed by children and grown-ups alike. People who can’t drink milk turn it into yogurt and eat it instead.",
    "Its milk is delicious and chock-full of nutrients. However, if you drink too much, it could make your stomach hurt, so be careful.",
    "Miltank gives over five gallons of milk on a daily basis. Its sweet milk is enjoyed by children and grown-ups alike. People who can’t drink milk turn it into yogurt and eat it instead.",
    "If it is around babies, the milk it produces contains much more nutrition than usual."
  ],
  "genera": [
    {
      "genus": "Milk Cow Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}