{
  "id": 246,
  "name": "larvitar",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "rock",
        "url": "https://pokeapi.co/api/v2/type/6/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "ground",
        "url": "https://pokeapi.co/api/v2/type/5/"
      }
    }
  ],
  "flavor_text_entries": [
    "A Larvitar is born deep under the ground. It must eat its way through the soil above and reach the surface for it to see its parents’ faces.",
    "Raised on nutrients it finds in the dirt, it eats roughly a mountain’s worth of dirt before it becomes a pupa.",
    "Larvitar is born deep under the ground. To come up to the surface, this Pokémon must eat its way through the soil above. Until it does so, Larvitar cannot see its parents.",
    "Larvitar is born deep under the ground. To come up to the surface, this Pokémon must eat its way through the soil above. Until it does so, Larvitar cannot see its parent’s face.",
    "It feeds on soil. After it has eaten a large mountain, it falls asleep so it can grow.",
    "Born underground, it eats its way through dirt to the surface, where its parents are. It doesn’t deal well with the bright light it finds there.",
    "It is born deep underground. It can’t emerge until it has entirely consumed the soil around it.",
    "A Pokémon that eats soil. Once it has eaten a large mountain, it goes to sleep so it can grow.",
    "It feeds on soil. After it has eaten a large mountain, it will fall asleep so it can grow.",
    "Born deep underground, this Pokémon becomes a pupa after eating enough dirt to make a mountain.",
    "It is born deep underground. It can't emerge until it has entirely consumed the soil around it.",
    "Born deep underground, it comes aboveground and becomes a pupa once it has finished eating the surrounding soil."
  ],
  "genera": [
    {
      "genus": "Rock Skin Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}