{
  "id": 25,
  "name": "pikachu",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "electric",
        "url": "https://pokeapi.co/api/v2/type/13/"
      }
    }
  ],
  "flavor_text_entries": [
    "Whenever Pikachu comes across something new, it blasts it with a jolt of electricity. If you come across a blackened berry, it’s evidence that this Pokémon mistook the intensity of its charge.",
    "While sleeping, it generates electricity in the sacs in its cheeks. If it’s not getting enough sleep, it will be able to use only weak electricity.",
    "When several of these Pokémon gather, their electricity could build and cause lightning storms.",
    "It occasionally uses an electric shock to recharge a fellow Pikachu that is in a weakened state.",
    "It keeps its tail raised to monitor its surroundings. If you yank its tail, it will try to bite you.",
    "When it is angered, it immediately discharges the energy stored in the pouches in its cheeks.",
    "This intelligent Pokémon roasts hard BERRIES with electricity to make them tender enough to eat.",
    "It lives in forests with others. It stores electricity in the pouches on its cheeks.",
    "It raises its tail to check its surroundings. The tail is sometimes struck by lightning in this pose.",
    "Its nature is to store up electricity. Forests where nests of Pikachu live are dangerous, since the trees are so often struck by lightning.",
    "This intelligent Pokémon roasts hard berries with electricity to make them tender enough to eat.",
    "When Pikachu meet, they’ll touch their tails together and exchange electricity through them as a form of greeting.",
    "This Pokémon has electricity-storing pouches on its cheeks. These appear to become electrically charged during the night while Pikachu sleeps. It occasionally discharges electricity when it is dozy after waking up.",
    "This forest-dwelling Pokémon stores electricity in its cheeks, so you’ll feel a tingly shock if you touch it.",
    "When several of these Pokémon gather, their electricity can build and cause lightning storms.",
    "A plan was recently announced to gather many Pikachu and make an electric power plant.",
    "Possesses cheek sacs in which it stores electricity. This clever forest-dweller roasts tough berries with an electric shock before consuming them.",
    "It’s in its nature to store electricity. It feels stressed now and then if it’s unable to fully discharge the electricity.",
    "If it looses crackling power from the electric pouches on its cheeks, it is being wary.",
    "Pikachu that can generate powerful electricity have cheek sacs that are extra soft and super stretchy.",
    "It stores electricity in the electric sacs on its cheeks. When it releases pent-up energy in a burst, the electric power is equal to a lightning bolt.",
    "It has small electric sacs on both its cheeks. If threatened, it looses electric charges from the sacs."
  ],
  "genera": [
    {
      "genus": "Mouse Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}