{
  "id": 282,
  "name": "gardevoir",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "psychic",
        "url": "https://pokeapi.co/api/v2/type/14/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "fairy",
        "url": "https://pokeapi.co/api/v2/type/18/"
      }
    }
  ],
  "flavor_text_entries": [
    "Gardevoir has the ability to read the future. If it senses impending danger to its TRAINER, this Pokémon is said to unleash its psychokinetic energy at full power.",
    "To protect its Trainer, it will expend all its psychic power to create a small black hole.",
    "Gardevoir has the ability to read the future. If it senses impending danger to its Trainer, this Pokémon is said to unleash its psychokinetic energy at full power.",
    "It has the power to predict the future. Its power peaks when it is protecting its TRAINER.",
    "It unleashes psychokinetic energy at full power when protecting a Trainer it has bonded closely with.",
    "It will try to guard its trusted Trainer with its life. It has the ability to see the future.",
    "Gardevoir has the psychokinetic power to distort the dimensions and create a small black hole. This Pokémon will try to protect its TRAINER even at the risk of its own life.",
    "It will dedicate itself to defending a master it has come to adore. Its pure white dress, reminiscent of those worn by ladies of nobility, is the dress of one who is willing to risk their life.",
    "It has the power to predict the future. Its power peaks when it is protecting its Trainer.",
    "Gardevoir has the psychokinetic power to distort the dimensions and create a small black hole. This Pokémon will try to protect its Trainer even at the risk of its own life.",
    "It apparently does not feel the pull of gravity because it supports itself with psychic power. It will give its life to protect its TRAINER."
  ],
  "genera": [
    {
      "genus": "Embrace Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}