{
  "id": 284,
  "name": "masquerain",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "bug",
        "url": "https://pokeapi.co/api/v2/type/7/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "flying",
        "url": "https://pokeapi.co/api/v2/type/3/"
      }
    }
  ],
  "flavor_text_entries": [
    "It intimidates enemies with the eye-like patterns on its antennae. Its four wings allow it to fly in any direction.",
    "Its antennae have eye patterns on them. Its four wings enable it to hover and fly in any direction.",
    "Masquerain intimidates enemies with the eyelike patterns on its antennas. This Pokémon flaps its four wings to freely fly in any direction—even sideways and backwards—as if it were a helicopter.",
    "It flaps its four wings to hover and fly freely in any direction-- to and fro and sideways.",
    "Masquerain intimidates enemies with the eyelike patterns on its antennas. This Pokémon flaps its four wings to freely fly in any direction - even sideways and backwards - as if it were a helicopter.",
    "It intimidates foes with the large eyelike patterns on its antennae. Because it can’t fly if its wings get wet, it shelters itself from rain under large trees and eaves.",
    "Masquerain intimidates enemies with the eyelike patterns of its eyespots. If that doesn’t work, it deftly makes its escape on its set of four wings.",
    "Its thin, winglike antennae are highly absorbent. It waits out rainy days in tree hollows.",
    "Masquerain’s antennas have eyelike patterns that usually give it an angry look. If the “eyes” are droopy and appear sad, it is said to be a sign that a heavy rainfall is on its way.",
    "Its wings and antennae don’t cope well with moisture. After a rain, it faces sunward to dry off.",
    "The antennae have distinctive patterns that look like eyes. When it rains, they grow heavy, making flight impossible.",
    "It flaps its four wings to hover and fly freely in any direction--to and fro and sideways."
  ],
  "genera": [
    {
      "genus": "Eyeball Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}