{
  "id": 29,
  "name": "nidoran-f",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "poison",
        "url": "https://pokeapi.co/api/v2/type/4/"
      }
    }
  ],
  "flavor_text_entries": [
    "Females are more sensitive to smells than males. While foraging, they’ll use their whiskers to check wind direction and stay downwind of predators.",
    "Though small, it must be treated with caution because of its powerfully toxic barbs. The female has smaller horns.",
    "NIDORAN has barbs that secrete a powerful poison. They are thought to have developed as protection for this small-bodied Pokémon. When enraged, it releases a horrible toxin from its horn.",
    "Nidoran♀ has barbs that secrete a powerful poison. They are thought to have developed as protection for this small-bodied Pokémon. When enraged, it releases a horrible toxin from its horn.",
    "A mild-mannered Pokémon that does not like to fight. Beware, its small horns secrete venom.",
    "A mild-mannered Pokémon that does not like to fight. Beware—its small horn secretes venom.",
    "Although small, its venomous barbs render this Pokémon dangerous. The female has smaller horns.",
    "The poison hidden in its small horn is extremely po­ tent. Even a tiny scratch can have fatal results.",
    "The poison hidden in its small horn is extremely potent. Even a tiny scratch can have fatal results.",
    "Its highly toxic barbs are thought to have developed as protection for this small- bodied Pokémon. When enraged, it releases a horrible toxin from its horn.",
    "Small and very docile, it protects itself with its small, poisonous horn when attacked.",
    "While it does not prefer to fight, even one drop of the poison it secretes from barbs can be fatal.",
    "It uses its hard incisor teeth to crush and eat berries. The tip of a female Nidoran’s horn is a bit more rounded than the tip of a male’s horn.",
    "Although not very combative, it will torment its foes with poison spikes if it is threatened in any way."
  ],
  "genera": [
    {
      "genus": "Poison Pin Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}