{
  "id": 292,
  "name": "shedinja",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "bug",
        "url": "https://pokeapi.co/api/v2/type/7/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "ghost",
        "url": "https://pokeapi.co/api/v2/type/8/"
      }
    }
  ],
  "flavor_text_entries": [
    "Shedinja’s hard body doesn’t move—not even a twitch. In fact, its body appears to be merely a hollow shell. It is believed that this Pokémon will steal the spirit of anyone peering into its hollow body from its back.",
    "Shedinja is a peculiar Pokémon. It seems to appear unsought in a POKé BALL after a NINCADA evolves. This bizarre Pokémon is entirely immobile - it doesn’t even breathe.",
    "A strange Pokémon—it flies without moving its wings, has a hollow shell for a body, and does not breathe.",
    "A most peculiar Pokémon that somehow appears in a Poké Ball when a Nincada evolves.",
    "A strange Pokémon--it flies without moving its wings, has a hollow shell for a body, and does not breathe.",
    "Shedinja is a peculiar Pokémon. It seems to appear unsought in a Poké Ball after a Nincada evolves. This bizarre Pokémon is entirely immobile—it doesn’t even breathe.",
    "Shedinja’s hard body doesn’t move - not even a twitch. In fact, its body appears to be merely a hollow shell. It is believed that this Pokémon will steal the spirit of anyone peering into its hollow body from its back.",
    "A most peculiar Pokémon that somehow appears in a POKé BALL when a NINCADA evolves.",
    "A discarded bug shell that came to life. Peering into the crack on its back is said to steal one’s spirit.",
    "A peculiar Pokémon that floats in air even though its wings remain completely still. The inside of its body is hollow and utterly dark."
  ],
  "genera": [
    {
      "genus": "Shed Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}