{
  "id": 303,
  "name": "mawile",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "steel",
        "url": "https://pokeapi.co/api/v2/type/9/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "fairy",
        "url": "https://pokeapi.co/api/v2/type/18/"
      }
    }
  ],
  "flavor_text_entries": [
    "Don’t be taken in by this Pokémon’s cute face—it’s very dangerous. Mawile fools the foe into letting down its guard, then chomps down with its massive jaws. The steel jaws are really horns that have been transformed.",
    "It has two mouths. The big jaws on the back of its head can’t taste anything, so that’s the mouth it uses to eat foods it doesn’t like.",
    "Mawile’s huge jaws are actually steel horns that have been transformed. Its docile-looking face serves to lull its foe into letting down its guard. When the foe least expects it, Mawile chomps it with its gaping jaws.",
    "A cunning and terrifying Pokémon, its cuteness makes opponents let down their guard—and then it swallows them whole with its huge jaws.",
    "Don’t be taken in by this Pokémon’s cute face - it’s very dangerous. Mawile fools the foe into letting down its guard, then chomps down with its massive jaws. The steel jaws are really horns that have been transformed.",
    "It uses its docile-looking face to lull foes into complacency, then bites with its huge, relentless jaws.",
    "Its giant jaws are actually steel horns that transformed. It fools foes into complacency with its adorable gestures, then chomps them with its huge jaws.",
    "MAWHILE’s huge jaws are actually steel horns that have been transformed. Its docile-looking face serves to lull its foe into letting down its guard. When the foe least expects it, MAWHILE chomps it with its gaping jaws.",
    "It chomps with its gaping mouth. Its huge jaws are actually steel horns that have been transformed.",
    "Attached to its head is a huge set of jaws formed by horns. It can chew through iron beams."
  ],
  "genera": [
    {
      "genus": "Deceiver Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}