{
  "id": 319,
  "name": "sharpedo",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "water",
        "url": "https://pokeapi.co/api/v2/type/11/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "dark",
        "url": "https://pokeapi.co/api/v2/type/17/"
      }
    }
  ],
  "flavor_text_entries": [
    "Sharpedo can swim at speeds of up to 75 mph by jetting seawater out of its backside. This Pokémon’s drawback is its inability to swim long distances.",
    "The vicious and sly gangster of the sea. Its skin is specially textured to minimize drag in water. Its speed tops out at over 75 miles per hour.",
    "Nicknamed “the bully of the sea,” Sharpedo is widely feared. Its cruel fangs grow back immediately if they snap off. Just one of these Pokémon can thoroughly tear apart a supertanker.",
    "Its fangs rip through sheet iron. It swims at 75 mph and is known as “The Bully of the Sea. ”",
    "As soon as it catches the scent of prey, Sharpedo will jet seawater from its backside, hurtling toward the target to attack at 75 mph.",
    "People believe that carrying one of its discarded fangs will prevent mishaps at sea, so the fangs are made into accessories.",
    "It pursues its prey at speeds of 75 mph and finishes them off with fangs that can crush iron. It is known as the bully of the sea.",
    "It has a sad history. In the past, its dorsal fin was a treasured foodstuff, so this Pokémon became a victim of overfishing.",
    "It can swim at speeds of 75 mph by jetting seawater through its body. It is the bandit of the sea.",
    "The ruffian of the seas, it has fangs that crunch through iron. It swims by jetting water from its rear.",
    "This Pokémon is known as the Bully of the Sea. Any ship entering the waters Sharpedo calls home will be attacked—no exceptions.",
    "It drinks in seawater and jets it from its rear to propel itself. It’s very sensitive to the scent of blood."
  ],
  "genera": [
    {
      "genus": "Brutal Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}