{
  "id": 339,
  "name": "barboach",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "water",
        "url": "https://pokeapi.co/api/v2/type/11/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "ground",
        "url": "https://pokeapi.co/api/v2/type/5/"
      }
    }
  ],
  "flavor_text_entries": [
    "Barboach uses its whiskers to taste things just as a person uses his or her tongue to taste things.",
    "Its whiskers make a superb radar. They are used to locate prey, even in the murkiest of water.",
    "Its two whiskers provide a sensitive radar. Even in muddy waters, it can detect its prey’s location.",
    "Its body is covered with a slimy film. The film acts as a barrier to prevent germs in muddy water from entering the Barboach’s body.",
    "Its entire body is gooey. When pecked at by bird Pokémon, it slips and slides its way to freedom.",
    "Makes its home in swamps with murky water. The poor visibility hides this Pokémon from predators, and the slime on its body makes grasping it difficult.",
    "Barboach’s sensitive whiskers serve as a superb radar system. This Pokémon hides in mud, leaving only its two whiskers exposed while it waits for prey to come along.",
    "Barboach’s body is covered with a slimy film. If a foe grabs it, this Pokémon just slips out of the enemy’s grip. This Pokémon grows weak if the slimy coating dries up.",
    "It coats its entire body with a slimy fluid so it can squirm and slip away if grabbed.",
    "Its whiskers are filled with nerves. They can sense smells and flavors just as a person’s nose or tongue would.",
    "It probes muddy riverbeds with its two long whiskers. A slimy film protects its body.",
    "Its slippery body is hard to grasp, so much so that there are festivals where people compete to see how many they can catch barehanded.",
    "Its slimy body is hard to grasp. In one region, it is said to have been born from hardened mud."
  ],
  "genera": [
    {
      "genus": "Whiskers Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}