{
  "id": 34,
  "name": "nidoking",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "poison",
        "url": "https://pokeapi.co/api/v2/type/4/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "ground",
        "url": "https://pokeapi.co/api/v2/type/5/"
      }
    }
  ],
  "flavor_text_entries": [
    "It is recognized by its rock-hard hide and its extended horn. Be careful with the horn, as it contains venom.",
    "It uses its thick arms, legs and tail to attack forcefully. Melee combat is its specialty.",
    "Its tail is thick and powerful. If it binds an enemy, it can snap the victim's spine quite easily.",
    "It swings its big tail around during battle. If its foe flinches, it will charge with its sturdy body.",
    "It uses its powerful tail in battle to smash, constrict, then break the prey's bones.",
    "A Nidoking’s thick tail packs enormously destructive power capable of toppling a metal transmission tower. Once it goes on a rampage, there is no stopping it.",
    "Its tail is thick and powerful. If it binds an enemy, it can render the victim helpless quite easily.",
    "Its steel-like hide adds to its powerful tackle. Its horns are so hard, they can pierce a diamond.",
    "When it goes on a rampage, it’s impossible to control. But in the presence of a Nidoqueen it’s lived with for a long time, Nidoking calms down.",
    "It is recognized by its rock-hard hide and its extended horn. Be careful with the horn as it contains venom.",
    "It uses its powerful tail in battle to smash, constrict, then break the prey’s bones.",
    "Nidoking’s thick tail packs enormously destructive power. With one swing, it can topple a metal transmission tower. Once this Pokémon goes on a rampage, there is no stopping it.",
    "One swing of its mighty tail can snap a telephone pole as if it were a matchstick.",
    "Nidoking prides itself on its strength. It’s forceful and spirited in battle, making use of its thick tail and diamond-crushing horn."
  ],
  "genera": [
    {
      "genus": "Drill Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}