{
  "id": 340,
  "name": "whiscash",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "water",
        "url": "https://pokeapi.co/api/v2/type/11/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "ground",
        "url": "https://pokeapi.co/api/v2/type/5/"
      }
    }
  ],
  "flavor_text_entries": [
    "It makes its nest at the bottom of swamps. It will eat anything—if it is alive, Whiscash will eat it.",
    "It is extremely protective of its territory. If any foe approaches, it attacks using vicious tremors.",
    "If Whiscash goes on a wild rampage, it sets off a quake-like tremor with a radius of over three miles. This Pokémon has the ability to predict real earthquakes.",
    "Whiscash shakes the ground at high intensities to intimidate its opponents. It swallows its prey whole—along with mud from the swamp floor.",
    "It makes its nest at the bottom of swamps. It will eat anything--if it is alive, Whiscash will eat it.",
    "It claims a large swamp to itself. If a foe comes near it, it sets off tremors by thrashing around.",
    "Its vision is not that good. It senses vibrations in the water with its whiskers to determine the location of its prey.",
    "As a result of causing tremors by thrashing about, it developed the ability to foretell real quakes.",
    "Strikes its caudal fin against the swamp bed to shake the ground and startle its prey. It will then swallow the fleeing prey whole. People mistook this behavior as the cause of earthquakes.",
    "It is very territorial. It repels foes by setting off tremors that extend over a three-mile radius.",
    "Sighting Whiscash leaping from the water is believed to herald an earthquake.",
    "Whiscash is extremely territorial. Just one of these Pokémon will claim a large pond as its exclusive territory. If a foe approaches it, it thrashes about and triggers a massive earthquake.",
    "It makes its nest at the bottom of  swamps. It will eat anything - if it is alive, Whiscash will eat it.",
    "Mysteriously, it can foretell earthquakes. In the daytime, it sleeps in mud at the bottom of a pond. When it awakens, it continually feeds throughout the night.",
    "A glutton that devours anything that moves, it quietly lurks at the bottom of swamps, lying in wait for prey."
  ],
  "genera": [
    {
      "genus": "Whiskers Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}