{
  "id": 349,
  "name": "feebas",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "water",
        "url": "https://pokeapi.co/api/v2/type/11/"
      }
    }
  ],
  "flavor_text_entries": [
    "It eats anything, so it can even live in polluted streams and lakes. No one pays any attention to it.",
    "Ridiculed for its shabby appearance, it is ignored by researchers. It lives in ponds choked with weeds.",
    "It is the shabbiest Pokémon of all. It forms in schools and lives at the bottom of rivers.",
    "Because of its wretched appearance, most people pay it no attention, but there are some who collect Feebas—and Feebas alone!",
    "It is famous for its shabby appearance. While populous, they tend to cluster in set locations.",
    "It is a shabby and ugly Pokémon. However, it is very hardy and can survive on little water.",
    "A tough Pokémon that is perfectly fine even in dirty water. However, due to its ragged, shabby appearance, it isn’t popular.",
    "Feebas live in ponds that are heavily infested with weeds. Because of its hopelessly shabby appearance, it seems as if few TRAINERS raise it.",
    "Feebas’s fins are ragged and tattered from the start of its life. Because of its shoddy appearance, this Pokémon is largely ignored. It is capable of living in both the sea and in rivers.",
    "Although unattractive and unpopular, this Pokémon’s marvelous vitality has made it a subject of research.",
    "While Feebas’s body is in tatters, it has a hardy and tenacious life force that enables it to live anywhere. However, this Pokémon is also slow and dimwitted, making it an easy catch.",
    "They look ragged, so no one catches them. They look like they’d taste bad, so predators won’t eat them. And their numbers continue to grow."
  ],
  "genera": [
    {
      "genus": "Fish Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}