{
  "id": 350,
  "name": "milotic",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "water",
        "url": "https://pokeapi.co/api/v2/type/11/"
      }
    }
  ],
  "flavor_text_entries": [
    "It’s said that a glimpse of a Milotic and its beauty will calm any hostile emotions you’re feeling.",
    "Milotic live at the bottom of large lakes. When this Pokémon’s body glows a vivid pink, it releases a pulsing wave of energy that brings soothing calm to troubled hearts.",
    "Milotic is breathtakingly beautiful. Those that see it are said to forget their combative spirits.",
    "Milotic has provided inspiration to many artists. It has even been referred to as the most beautiful Pokémon of all.",
    "Milotic is said to be the most beautiful of all the Pokémon. It has the power to becalm such emotions as anger and hostility to quell bitter feuding.",
    "It lives at the bottom of clear lakes. In times of war, it shows itself, which soothes people’s minds and hearts.",
    "Its lovely scales are described as rainbow colored. They change color depending on the viewing angle.",
    "It is said to live at the bottom of large lakes. Considered to be the most beautiful of all Pokémon, it has been depicted in paintings and statues.",
    "When people bicker, it is said to arise from the depths of lakes to becalm violent hearts.",
    "It is the world’s most beautiful Pokémon. There are many works of art featuring Milotic.",
    "Milotic live at the bottom of large lakes. When this Pokémon’s body glows a vivid pink, it releases a pulsing wave of energy that brings soothing calm to restless spirits.",
    "While Milotic is said to be the most beautiful Pokémon, Trainers who like Feebas and have raised it are seemingly disappointed by Milotic.",
    "Its dwelling place is the bottom of big lakes. Those who behold its loveliness are said to have their hearts purified."
  ],
  "genera": [
    {
      "genus": "Tender Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}