{
  "id": 361,
  "name": "snorunt",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "ice",
        "url": "https://pokeapi.co/api/v2/type/15/"
      }
    }
  ],
  "flavor_text_entries": [
    "It’s said that if they are seen at midnight, they’ll cause heavy snow. They eat snow and ice to survive.",
    "Arrives alongside the first snow. It's thought that homes Snorunt visit will prosper for many generations. By tradition, one might offer a lump of ice made from pure water at one's front door.",
    "Rich people from cold areas all share childhood memories of playing with Snorunt.",
    "Their numbers seem to have rapidly increased in Alola. Custom has it that houses where Snorunt live will be prosperous for generations to come.",
    "It feeds mainly on ice and snow. It’s only able to survive in a limited number of places in the warm Alola region.",
    "Snorunt survives by eating only snow and ice. Old folklore claims that a house visited by this Pokémon is sure to prosper for many generations to come.",
    "In the snow country, certain folklore says a house will prosper if a Snorunt lives there.",
    "It is said that a home visited by a Snorunt will prosper. It can withstand cold of minus 150 degrees Fahrenheit.",
    "Snorunt live in regions with heavy snowfall. In seasons without snow, such as spring and summer, this Pokémon steals away to live quietly among stalactites and stalagmites deep in caverns.",
    "It can only survive in cold areas. It bounces happily around, even in environments as cold as −150 degrees Fahrenheit.",
    "It can only survive in cold areas. It bounces happily around, even in environments as cold as -150 degrees Fahrenheit.",
    "It is said that several Snorunt gather under giant leaves and live together in harmony.",
    "They tend to move about in groups of around five Snorunt. In snowy regions, it is said that when they are seen late at night, snowfall will arrive by morning."
  ],
  "genera": [
    {
      "genus": "Snow Hat Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}