{
  "id": 362,
  "name": "glalie",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "ice",
        "url": "https://pokeapi.co/api/v2/type/15/"
      }
    }
  ],
  "flavor_text_entries": [
    "Its actual body is a rock that isn’t particularly hard. Glalie absorbs moisture from the air and drapes itself in an armor of ice.",
    "To protect itself, it clads its body in an armor of ice, made by freezing moisture in the air.",
    "Glalie has a body made of rock, which it hardens with an armor of ice. This Pokémon has the ability to freeze moisture in the atmosphere into any shape it desires.",
    "It prevents prey from escaping by instantaneously freezing moisture in the air.",
    "Its prey is instantaneously frozen stiff by the cold air it exhales from its huge mouth. While they’re in that frozen state, it gobbles them up.",
    "Glalie has the ability to freely control ice. For example, it can instantly freeze its foe solid. After immobilizing its foe in ice, this Pokémon enjoys eating it in leisurely fashion.",
    "It freezes its prey and chews them whole. However, it prefers to eat Pokémon like Vanillite that are already frozen.",
    "It covers its body with an armor of ice harder than steel. Uses its breath to freeze prey, which it then devours as if they were frozen desserts.",
    "Glalie has the ability to freely control ice. For example, it can instantly freeze its prey solid. After immobilizing its prey in ice, this Pokémon enjoys eating it in leisurely fashion.",
    "It can instantly freeze moisture in the atmosphere. It uses this power to freeze its foes.",
    "It has a body of ice that won’t melt, even with fire. It can instantly freeze moisture in the atmosphere.",
    "A Glalie has the power to instantaneously freeze moisture in the atmosphere. A dazzling cloud of diamondlike ice crystals forms around its body.",
    "To protect itself, it clad its body in an armor of ice, made by freezing moisture in the air.",
    "Legend says a boulder on an icy mountain absorbed the distress and regrets of a stranded mountaineer, giving rise to Glalie."
  ],
  "genera": [
    {
      "genus": "Face Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}