{
  "id": 364,
  "name": "sealeo",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "ice",
        "url": "https://pokeapi.co/api/v2/type/15/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "water",
        "url": "https://pokeapi.co/api/v2/type/11/"
      }
    }
  ],
  "flavor_text_entries": [
    "Be it Spheal or Poké Ball, it will spin any round object on its nose with the greatest of ease.",
    "Sealeo has the habit of always juggling on the tip of its nose anything it sees for the first time. This Pokémon occasionally entertains itself by balancing and rolling a Spheal on its nose.",
    "Sealeo live in herds on ice floes. Using its powerful flippers, it shatters ice. It dives into the sea to hunt prey five times a day.",
    "Sealeo has the habit of always juggling on the tip of its nose anything it sees for the first time. This Pokémon occasionally entertains itself by balancing and rolling a SPHEAL on its nose.",
    "Sealeo live on top of drift ice. They go swimming when they’re on the hunt, seeking out their prey by scent.",
    "This Pokémon has a habit of spinning round things on its nose, whether those things are Poké Balls or Spheal.",
    "Its white whiskers are very sensitive. Sealeo will balance Spheal on the tip of its nose, checking its scent and its feel to be sure the Spheal is healthy.",
    "It touches new things with its nose to test for smell and feel. It plays by spinning SPHEAL on its nose.",
    "Sealeo often balances and rolls things on the tip of its nose. While the Pokémon is rolling something, it checks the object’s aroma and texture to determine whether it likes the object or not.",
    "It habitually spins things on its nose. By doing so, it learns textures and odors.",
    "It has a very sensitive nose. It touches new things with its nose to examine them."
  ],
  "genera": [
    {
      "genus": "Ball Roll Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}