{
  "id": 365,
  "name": "walrein",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "ice",
        "url": "https://pokeapi.co/api/v2/type/15/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "water",
        "url": "https://pokeapi.co/api/v2/type/11/"
      }
    }
  ],
  "flavor_text_entries": [
    "Walrein’s two massively developed tusks can totally shatter blocks of ice weighing 10 tons with one blow. This Pokémon’s thick coat of blubber insulates it from subzero temperatures.",
    "Walrein form herds of 20 to 30 individuals. When a threat appears, the herd’s leader will protect the group with its life.",
    "Walrein’s tusks keep growing throughout its life. Tusks broken in battle will grow back to their usual impressive size in a year.",
    "Its thick tusks are strong enough to shatter drift ice. They have been known to break, but they will grow back by the next year. The Hisui region is well known for these broken tusks.",
    "To protect its herd, the leader battles anything that invades its territory, even at the cost of its life. Its tusks may snap off in battle.",
    "It swims through icy seas while shattering ice floes with its large tusks. It is protected by its thick blubber.",
    "Not only does its thick blubber keep it warm, it also protects it from attacks. It shatters ice with its prized tusks.",
    "Walrein swims all over in frigid seawater while crushing icebergs with its grand, imposing tusks. Its thick layer of blubber makes enemy attacks bounce off harmlessly.",
    "It shatters ice with its big tusks. Its thick blubber repels not only the cold, but also enemy attacks.",
    "It shatters drift ice with its strong tusks. Its thick layer of blubber repels enemy attacks.",
    "Walrein’s two massively developed tusks can totally shatter blocks of ice weighing ten tons with one blow. This Pokémon’s thick coat of blubber insulates it from subzero temperatures."
  ],
  "genera": [
    {
      "genus": "Ice Break Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}