{
  "id": 38,
  "name": "ninetales",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "fire",
        "url": "https://pokeapi.co/api/v2/type/10/"
      }
    }
  ],
  "flavor_text_entries": [
    "It is said to live 1,000 years, and each of its tails is loaded with supernatural powers.",
    "It is said to live a thousand years, and each of its tails is loaded with supernatural powers.",
    "Its nine tails are said to be imbued with a mystic power. It can live for a thousand years.",
    "It has nine long tails and fur that  gleams gold. It is said to live for  1,000 years.",
    "Very smart and very vengeful. Grabbing one of its many tails could result in a 1,000-year curse.",
    "According to an enduring legend, nine noble saints were united and reincarnated as this Pokémon.",
    "Some legends claim that each of its nine tails has its own unique type of special mystical power.",
    "It has long been said that each of the nine tails embody an enchanted power. A long-lived Ninetales will have fur that shines like gold.",
    "It has nine long tails and fur that gleams gold. It is said to live for 1,000 years.",
    "Each of its nine tails is imbued with supernatural power, and it can live for a thousand years.",
    "Legend has it that this mystical Pokémon was formed when nine saints coalesced into one.",
    "Ninetales casts a sinister light from its bright red eyes to gain total control over its foe’s mind. This Pokémon is said to live for a thousand years.",
    "It is vindictive and relentless by nature. Those who cross it even once will be cursed for a thousand years, along with their descendants.",
    "Its nine beautiful tails are filled with a wondrous energy that could keep it alive for 1,000 years.",
    "Legend has it that Ninetales came into being when nine wizards possessing sacred powers merged into one. This Pokémon is highly intelligent - it can understand human speech.",
    "The coat of gleaming golden fur is quite magnificent. This species is said to store sacred power in its nine long tails and to live for a millennium.",
    "Very smart and very vengeful. Grabbing one of its many tails could result in a 1000-year curse.",
    "Legend has it that Ninetales came into being when nine wizards possessing sacred powers merged into one. This Pokémon is highly intelligent—it can understand human speech.",
    "Said to live for a thousand years, this Pokémon uses its supernatural abilities to manipulate fire. It can burn its prey to a crisp as it pleases.",
    "The flickering flames it spews from its mouth leave its opponents hypnotized. Then, this extremely intelligent Pokémon attacks.",
    "According to an enduring legend, 9 noble saints were united and reincarnated as this Pokémon."
  ],
  "genera": [
    {
      "genus": "Fox Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}