{
  "id": 39,
  "name": "jigglypuff",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "normal",
        "url": "https://pokeapi.co/api/v2/type/1/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "fairy",
        "url": "https://pokeapi.co/api/v2/type/18/"
      }
    }
  ],
  "flavor_text_entries": [
    "When its huge eyes light up, it sings a mysteriously soothing melody that lulls its enemies to sleep.",
    "If it inflates to SING a lullaby, it can perform longer and cause sure drowsiness in its audience.",
    "Jigglypuff’s vocal chords can freely adjust the wavelength of its voice. This Pokémon uses this ability to sing at precisely the right wavelength to make its foes most drowsy.",
    "By freely changing the wavelength of its voice, Jigglypuff sings a mysterious melody sure to make any listener sleepy.",
    "Recordings of Jigglypuff’s strange lullabies can be purchased from department stores. These CDs can be found near the bedding area.",
    "Uses its cute round eyes to enrapture its foe. It then sings a pleasing melody that lulls the foe to sleep.",
    "It rolls its cute eyes as it sings a soothing lullaby. Its gentle song puts anyone who hears it to sleep.",
    "Looking into its cute, round eyes makes it start singing a song so pleasant listeners can’t help but fall asleep.",
    "If it inflates to sing a lullaby, it can perform longer and cause sure drowsiness in its audience.",
    "Nothing can avoid falling asleep hearing a Jigglypuff’s song. The sound waves of its singing voice match the brain waves of someone in a deep sleep.",
    "When it wavers its big, round eyes, it begins singing a lullaby that makes everyone drowsy.",
    "Jigglypuff possess a vocal range that exceeds 12 octaves, but each individual’s singing skill depends on its own effort.",
    "Looking into its cute, round eyes causes it to sing a relaxing melody, inducing its enemies to sleep.",
    "When this Pokémon sings, it never pauses to breathe. If it is in a battle against an opponent that does not easily fall asleep, Jigglypuff cannot breathe, endangering its life.",
    "It captivates foes with its huge, round eyes, then lulls them to sleep by singing a soothing melody.",
    "The songs they sing are totally different depending on the region they live in. Some even sound like they’re shouting!",
    "Jigglypuff’s vocal cords can freely adjust the wavelength of its voice. This Pokémon uses this ability to sing at precisely the right wavelength to make its foes most drowsy.",
    "Uses its alluring eyes to enrapture its foe. It then sings a pleasing melody that lulls the foe to sleep.",
    "When its huge eyes waver, it sings a mysteriously soothing melody that lulls its enemies to sleep.",
    "It hugely inflates its stomach and sings a mysterious melody. If you hear this melody, you’ll become sleepy right away.",
    "Jigglypuff has top-notch lung capacity, even by comparison to other Pokémon. It won’t stop singing its lullabies until its foes fall asleep."
  ],
  "genera": [
    {
      "genus": "Balloon Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}