{
  "id": 41,
  "name": "zubat",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "poison",
        "url": "https://pokeapi.co/api/v2/type/4/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "flying",
        "url": "https://pokeapi.co/api/v2/type/3/"
      }
    }
  ],
  "flavor_text_entries": [
    "It has no eyeballs, so it can’t see. It checks its surroundings via the ultrasonic waves it emits from its mouth.",
    "Their skin is so thin that they’ll be burned if sunlight hits them. When it gets cold out, they gather together to warm one another’s bodies.",
    "During the day, it gathers with others and hangs from the ceilings of old buildings and caves.",
    "When exposed to sunlight, they suffer burns. The frequency of their ultrasonic waves can differ slightly from colony to colony.",
    "It does not need eyes, because it emits ultrasonic waves to check its surroundings while it flies.",
    "Forms colonies in perpetually dark places. Uses ultrasonic waves to identify and approach targets.",
    "It checks its surroundings and location using reflections of the ultrasonic waves from its mouth.",
    "It has no eyes. Instead, it relies on its ultrasonic cries for echo location to flit about in darkness.",
    "It sleeps in caves during the day. It has no eyes, so to check its surroundings while flying, it emits ultrasonic waves.",
    "Zubat avoids sunlight because exposure causes it to become unhealthy. During the daytime, it stays in caves or under the eaves of old houses, sleeping while hanging upside down.",
    "It forms colonies in perpetually dark  places and uses ultrasonic waves to   identify and approach targets.",
    "It emits ultrasonic waves from its mouth to check its surroundings. Even in tight caves, Zubat flies around with skill.",
    "Capable of flying safely in dark places, it emits ultrasonic cries to check for any obstacles.",
    "Zubat live in caves, down where the sun’s light won’t reach. In the morning, they gather together to keep each other warm as they sleep.",
    "While living in pitch-black caverns, their eyes gradually grew shut and deprived them of vision. They use ultrasonic waves to detect obstacles.",
    "Emits ultrasonic cries while it flies. They act as a sonar used to check for objects in its way.",
    "Makes its home in gloomy caves. Atrophied eyes have left this Pokémon blind, so it scans its surroundings via sound waves that it emits from its mouth as it flies.",
    "Even though it has no eyes, it can sense obstacles using ultrasonic waves it emits from its mouth.",
    "Zubat remains quietly unmoving in a dark spot during the bright daylight hours. It does so because prolonged exposure to the sun causes its body to become slightly burned.",
    "It has no eyes. Instead, it relies on its ultrasonic cries for echolocation to flit about in darkness.",
    "While flying, it constantly emits ultrasonic waves from its mouth to check its surroundings.",
    "Disliking sunlight, it sleeps deep in forests and caves until sundown."
  ],
  "genera": [
    {
      "genus": "Bat Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}