{
  "id": 42,
  "name": "golbat",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "poison",
        "url": "https://pokeapi.co/api/v2/type/4/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "flying",
        "url": "https://pokeapi.co/api/v2/type/3/"
      }
    }
  ],
  "flavor_text_entries": [
    "Its fangs easily puncture even thick animal hide. It loves to feast on the blood of people and Pokémon. It flits about in darkness and strikes from behind.",
    "It clamps down on its prey with needle- sharp fangs and drains over 10 ounces of blood in one gulp.",
    "They can suck down over 10 ounces of blood in one go. They have been known to drink so much blood that they can no longer fly.",
    "However hard its victim's hide may be, it punctures with sharp fangs and gorges itself with blood.",
    "When it plunges its fangs into its prey, it instantly draws and gulps down more than ten ounces of blood.",
    "Once it strikes, it will not stop draining energy from the victim even if it gets too heavy to fly.",
    "However hard its victim’s hide may be, it punctures with sharp fangs and gorges itself with blood.",
    "Its sharp fangs puncture the toughest of hides and have small holes for greedily sucking blood.",
    "Every once in a while, you’ll see a Golbat that’s missing some fangs. This happens when hunger drives it to try biting a Steel-type Pokémon.",
    "Its feet are tiny, but this Pokémon walks skillfully. It sneaks up on sleeping prey before sinking in its fangs and slurping up blood.",
    "Sometimes they drink so much blood, they can’t fly anymore. Then they fall to the ground and become food for other Pokémon.",
    "Golbat loves to drink the blood of living things. It is particularly active in the pitch black of night. This Pokémon flits around in the night skies, seeking fresh blood.",
    "Its thick fangs are hollow like straws, making them unexpectedly fragile. These fangs are specialized for sucking blood.",
    "It sinks its sharp fangs into other creatures and slurps up their blood. A closer look at the fangs reveals that they are hollow and akin to straws.",
    "Once it starts sucking blood, it does not stop until it is full. It flies at night in search of prey.",
    "It loves the blood of humans and Pokémon. It flies around at night in search of neck veins.",
    "It can drink more than 10 ounces of blood at once. If it has too much, it gets heavy and flies clumsily.",
    "It attacks in a stealthy manner, without warning. Its sharp fangs are used to bite and suck blood.",
    "It attacks in a stealthy manner, without warning. Its sharp fangs are used to bite and to suck blood.",
    "Flitting around in the dead of night, it sinks its fangs into its prey and drains a nearly fatal amount of blood.",
    "Once it bites, it will not stop draining energy from the victim even if it gets too heavy to fly.",
    "Golbat bites down on prey with its four fangs and drinks the victim’s blood. It becomes active on inky dark moonless nights, flying around to attack people and Pokémon.",
    "It loves to drink other creatures’ blood. It’s said that if it finds others of its kind going hungry, it sometimes shares the blood it’s gathered."
  ],
  "genera": [
    {
      "genus": "Bat Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}