{
  "id": 426,
  "name": "drifblim",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "ghost",
        "url": "https://pokeapi.co/api/v2/type/8/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "flying",
        "url": "https://pokeapi.co/api/v2/type/3/"
      }
    }
  ],
  "flavor_text_entries": [
    "Even while under careful observation, large flocks of Drifblim flying at dusk will inexplicably disappear from view.",
    "It carries people and Pokémon when it flies. But since it only drifts, it can end up anywhere.",
    "It’s drowzy in daytime, but flies off in the evening in big groups. No one knows where they go.",
    "It drifts along at dusk, perfectly silent. Its transient, melancholy aspect touches some people deeply—every so often, one will come upon a song or poem devoted to Drifblim.",
    "There was once an incident in which a man took a trip riding a Drifblim, only to go missing.",
    "There’s a rumor that if you catch a Drifblim floating on the wind at dusk, you’ll be carried away to the afterlife.",
    "It can generate and release gas within its body. That’s how it can control the altitude of its drift.",
    "The raw material for the gas inside its body is souls. When its body starts to deflate, it’s thought to carry away people and Pokémon.",
    "It’s drowsy in daytime, but flies off in the evening in big groups. No one knows where they go.",
    "It grabs people and Pokémon and carries them off somewhere. Where do they go? Nobody knows.",
    "They carry people and Pokémon, but the wind can catch them, so there can’t be a fixed destination.",
    "At dusk, swarms of them are carried aloft on winds. When noticed, they suddenly vanish.",
    "Some say this Pokémon is a collection of souls burdened with regrets, silently drifting through the dusk."
  ],
  "genera": [
    {
      "genus": "Blimp Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}