{
  "id": 462,
  "name": "magnezone",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "electric",
        "url": "https://pokeapi.co/api/v2/type/13/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "steel",
        "url": "https://pokeapi.co/api/v2/type/9/"
      }
    }
  ],
  "flavor_text_entries": [
    "Some say that Magnezone receives signals from space via the antenna on its head and that it’s being controlled by some mysterious being.",
    "Exposure to a special magnetic field changed MAGNETON’s molecular structure, turning it into Magnezone.",
    "A group tried to use scientific means to make Magnezone evolve, but their efforts ended in failure.",
    "Three units generate magnetism. There have been many mistaken reports of UFO sightings when Magnezone flies through the night sky.",
    "It’s thought that a special magnetic field changed the molecular structure of this Pokémon’s body, and that’s what caused the Pokémon’s evolution.",
    "It evolved from exposure to a special magnetic field. Three units generate magnetism.",
    "I theorize that a special magnetic field influenced this Pokémon, changing its molecular structure and causing it to evolve. It emits strange radio waves toward space from its antenna.",
    "As it zooms through the sky, this Pokémon seems to be receiving signals of unknown origin, while transmitting signals of unknown purpose.",
    "There are still people who believe that this Pokémon came from outer space. It emanates a powerful magnetic field.",
    "It uses radar to monitor its territory. Intruders are quickly disposed of with a hyper beam.",
    "Sometimes the magnetism emitted by Magnezone is too strong, making them attract each other so they cannot move."
  ],
  "genera": [
    {
      "genus": "Magnet Area Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}