{
  "id": 47,
  "name": "parasect",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "bug",
        "url": "https://pokeapi.co/api/v2/type/7/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "grass",
        "url": "https://pokeapi.co/api/v2/type/12/"
      }
    }
  ],
  "flavor_text_entries": [
    "Parasect is known to infest large trees en masse and drain nutrients from the lower trunk and roots. When an infested tree dies, they move onto another tree all at once.",
    "It scatters toxic spores from the mushroom cap. In China, the spores are used as herbal medicine.",
    "The bug is mostly dead, with the mushroom on its back having become the main body. If the mushroom comes off, the bug stops moving.",
    "The larger the mushroom on its back grows, the stronger the mushroom spores it scatters.",
    "When nothing's left to extract from the bug, the mushrooms on its back leave spores on the bug's egg.",
    "Parasect are known to infest the roots of large trees en masse and drain nutrients. When an infested tree dies, they move onto another tree all at once.",
    "A mushroom grown larger than the host’s body controls Parasect. It scatters poisonous spores.",
    "It stays mostly in dark, damp places, the preference not of the bug, but of the big mushroom on its back.",
    "It stays mostly in dark, damp places, the preference not of the bug, but of the big mushrooms on its back.",
    "It is controlled by a mushroom grown larger than the bug body. It is said to prefer damp places.",
    "The bug host is drained of energy by the mushrooms on its back. They appear to do all the thinking.",
    "It scatters toxic spores from its mushroom cap. Once harvested, these spores can be steeped and boiled down to prepare herbal medicines.",
    "Its poisonous spores are also used in traditional medicine. Apparently, spores produced in Alola are not of very good quality.",
    "The bug host is drained of energy by the mushroom on its back. The mushroom appears to do all the thinking.",
    "Mushroom-lacking specimens of this Pokémon lie unmoving in the forest, lending credence to the hypothesis that the large mushroom is in control of Parasect's actions.",
    "A host-parasite pair in which the parasite mushroom has taken over the host bug. Prefers damp places.",
    "A host-parasite pair in which the parasite mushroom has taken over the host bug. Prefers damp places. ",
    "The large mushroom on its back controls it. It often fights over territory with Shiinotic."
  ],
  "genera": [
    {
      "genus": "Mushroom Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}