{
  "id": 478,
  "name": "froslass",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "ice",
        "url": "https://pokeapi.co/api/v2/type/15/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "ghost",
        "url": "https://pokeapi.co/api/v2/type/8/"
      }
    }
  ],
  "flavor_text_entries": [
    "Legends in snowy regions say that a woman who was lost on an icy mountain was reborn as Froslass",
    "When it finds humans or Pokémon it likes, it freezes them and takes them to its chilly den, where they become decorations.",
    "A Pokémon inhabited by the soul of a woman who died bearing a grudge in the snowy mountains. Legends of Froslass placing deathly curses on misbehaving men send shivers down my spine.",
    "Legends in snowy regions say that a woman who was lost on an icy mountain was reborn as Froslass.",
    "After a woman met her end on a snowy mountain, her regrets lingered on. From them, this Pokémon was born. Its favorite food is frozen souls.",
    "It freezes foes with an icy breath nearly -60 degrees F. What seems to be its body is actually hollow.",
    "The soul of a woman lost on a snowy mountain possessed an icicle, becoming this Pokémon. The food it most relishes is the souls of men.",
    "It’s said that on nights of terrible blizzards, it comes down to human settlements. If you hear it knocking at your door, do not open it!",
    "It freezes hikers who have come to climb snowy mountains and carries them back to its home. It only goes after men it thinks are handsome.",
    "It freezes foes with an icy breath nearly -60 degrees Fahrenheit. What seems to be its body is actually hollow.",
    "It spits out cold air of nearly −60 degrees Fahrenheit to freeze its quarry. It brings frozen prey back to its lair and neatly lines them up.",
    "It freezes prey by blowing its -58 degrees F breath. It is said to then secretly display its prey."
  ],
  "genera": [
    {
      "genus": "Snow Land Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}