{
  "id": 49,
  "name": "venomoth",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "bug",
        "url": "https://pokeapi.co/api/v2/type/7/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "poison",
        "url": "https://pokeapi.co/api/v2/type/4/"
      }
    }
  ],
  "flavor_text_entries": [
    "When it attacks, it flaps its large wings violently to scatter its poisonous powder all around.",
    "The powder on its wings is poisonous if it is dark in hue. If it is light in hue, it causes paralysis.",
    "Venomoth is nocturnal—it is a Pokémon that only becomes active at night. Its favorite prey are small insects that gather around streetlights, attracted by the light in the darkness.",
    "The dust-like scales covering its wings are color coded to indicate the kinds of poison it has.",
    "The wings are covered with dustlike scales. Every time it flaps its wings, it looses highly toxic dust.",
    "Venomoth are nocturnal--they only are active at night. Their favorite prey are insects that gather around streetlights, attracted by the light in the darkness.",
    "It flutters its wings to scatter dustlike scales. The scales leach toxins if they contact skin.",
    "The powder on its wings is poisonous if it is dark in color. If it is light, it causes paralysis.",
    "The powdery scales on its wings are hard to remove. They also contain poison that leaks out on contact.",
    "The dustlike scales covering its wings are color-coded to indicate the kinds of poison it has.",
    "Venomoth is nocturnal - it is a Pokémon that only becomes active at night. Its favorite prey are small insects that gather around streetlights, attracted by the light in the darkness.",
    "The scales it scatters will paralyze anyone who touches them, making that person unable to stand.",
    "The powdery scales on its wings are hard to remove from skin. They also contain poison that leaks out on contact."
  ],
  "genera": [
    {
      "genus": "Poison Moth Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}