{
  "id": 50,
  "name": "diglett",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "ground",
        "url": "https://pokeapi.co/api/v2/type/5/"
      }
    }
  ],
  "flavor_text_entries": [
    "It travels through tunnels that it digs underground. It hates sunlight, so it comes out only after the sun goes down.",
    "Lives about one yard underground where it feeds on plant roots. It sometimes appears aboveground.",
    "Around their crops, farmers plant the kind of tree that Diglett like to eat as a way of getting Diglett to plow the fields for them.",
    "Lives about one yard underground where it feeds on plant roots. It sometimes appears above ground.",
    "It burrows through the ground at a shallow depth. It leaves raised earth in its wake, making it easy to spot.",
    "Diglett are raised in most farms. The reason is simple— wherever this Pokémon burrows, the soil is left perfectly tilled for planting crops. This soil is made ideal for growing delicious vegetables.",
    "If a Diglett DIGS through a field, it leaves the soil perfectly tilled and ideal for planting crops.",
    "A Pokémon that lives underground. Because of its dark habitat, it is repelled by bright sunlight.",
    "Its skin is very thin. If it is exposed to light, its blood heats up, causing it to grow weak.",
    "If a Diglett digs through a field, it leaves the soil perfectly tilled and ideal for planting crops.",
    "Diglett are raised in most farms. The reason is simple--wherever they burrow, the soil is left perfectly tilled for growing delicious crops.",
    "It prefers dark places. It spends most of its time underground, though it may pop up in caves.",
    "Many farmers cherish and nurture Diglett because its droppings enrich the soil it lives in.",
    "Diglett are raised in most farms. The reason is simple - wherever this Pokémon burrows, the soil is left perfectly tilled for planting crops. This soil is made ideal for growing delicious vegetables.",
    "It chews on plant roots underground. Farmers whose vegetables are vulnerable find it can be quite a pest.",
    "It digs underground and chews on tree roots, sticking its head out only when the sun isn't bright."
  ],
  "genera": [
    {
      "genus": "Mole Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}