{
  "id": 52,
  "name": "meowth",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "normal",
        "url": "https://pokeapi.co/api/v2/type/1/"
      }
    }
  ],
  "flavor_text_entries": [
    "It is fascinated by round objects. It can't stop playing with them until it tires and falls asleep.",
    "Adores circular objects. Wanders the streets on a nightly basis to look for dropped loose change.",
    "It loves anything that shines. It especially adores coins that it picks up and secretly hoards.",
    "All it does is sleep during the daytime. At night, it patrols its territory with its eyes aglow.",
    "It is fascinated by round objects. It can’t stop playing with them until it tires and falls asleep.",
    "It loves shiny things. It often fights with Murkrow over prey they’re both trying to catch.",
    "When visiting a junkyard, you may catch sight of it having an intense fight with Murkrow over shiny objects.",
    "Appears to be more active at night. It loves round and shiny things. It can’t stop itself from picking them up.",
    "Meowth withdraws its sharp claws into its paws to slinkily sneak about without making any incriminating footsteps. For some reason, this Pokémon loves shiny coins that glitter with light.",
    "It washes its face regularly to keep the coin on its forehead spotless. It doesn’t get along with Galarian Meowth.",
    "Appears to be more active at night. It loves round and shiny things. It can't stop from picking them up.",
    "It loves things that sparkle. When it sees a shiny object, the gold coin on its head shines too.",
    "Meowth withdraw their sharp claws into their paws to silently sneak about. For some reason, this Pokémon loves shiny coins that glitter with light.",
    "It is nocturnal in nature. If it spots something shiny, its eyes glitter brightly.",
    "It loves coins, so if you give it one, you can make friends with Meowth easily. But it’s fickle, so you can’t count on that friendship lasting.",
    "It loves to collect shiny things. If it’s in a good mood, it might even let its Trainer have a look at its hoard of treasures.",
    "Adores round objects. It wanders the streets on a nightly basis to look for dropped loose change.",
    "It lies around all day, becoming active near dusk. At night, it wanders the city in search of loose change."
  ],
  "genera": [
    {
      "genus": "Scratch Cat Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}