{
  "id": 54,
  "name": "psyduck",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "water",
        "url": "https://pokeapi.co/api/v2/type/11/"
      }
    }
  ],
  "flavor_text_entries": [
    "Psyduck is constantly beset by headaches. If the Pokémon lets its strange power erupt, apparently the pain subsides for a while.",
    "Suffers perpetual headaches. If the agony grows too great, Psyduck's latent power erupts, contrary to Psyduck's intent. Ergo, I am exploring ways to ease the pain.",
    "As a result of headaches so fierce they cause it to cry, it sometimes uses psychokinesis without meaning to.",
    "If its chronic headache peaks, it may exhibit odd powers. It seems unable to recall such an episode.",
    "When its headache intensifies, it starts using strange powers. However, it has no recollection of its powers, so it always looks befuddled and bewildered.",
    "If its usual headache worsens, it starts exhibiting odd powers. It can’t remember doing so, however.",
    "It has mystical powers but doesn’t recall that it has used them. That is why it always looks puzzled.",
    "Psyduck uses a mysterious power. When it does so, this Pokémon generates brain waves that are supposedly only seen in sleepers. This discovery spurred controversy among scholars.",
    "This Pokémon is troubled by constant headaches. The more pain it’s in, the more powerful its psychokinesis becomes.",
    "It is constantly wracked by a headache. When the headache turns intense, it begins using mysterious powers.",
    "It has been found that its brain cells are 10 times more active when Psyduck is experiencing a headache.",
    "The only time it can use its psychic power is when its sleeping brain cells happen to wake.",
    "As Psyduck gets stressed out, its headache gets progressively worse. It uses intense psychic energy to overwhelm those around it.",
    "Psyduck uses a mysterious power. When it does so, this Pokémon  generates brain waves that are supposedly only seen in sleepers. This discovery spurred controversy among scholars.",
    "Always tormented by headaches. It uses psychic powers, but whether it intends to do so is not known.",
    "When headaches stimulate its brain cells, which are usually inactive, it can use a mysterious power.",
    "Overwhelmed by enigmatic abilities, it suffers a constant headache. It sometimes uses mysterious powers.",
    "While lulling its enemies with its vacant look, this wily Pokémon will use psychokinetic powers.",
    "It never remembers using its odd powers, so it always tilts its head in puzzlement.",
    "It has mystical powers but doesn't recall that it has used them. That is why it always looks puzzled.",
    "Always tormented by headaches. It uses psychic powers, but it is not known if it intends to do so.",
    "Using psychokinesis gives it a headache, so it normally passes the time spacing out and doing as little as possible.",
    "If it uses its mysterious power, Psyduck can’t remember having done so. It apparently can’t form a memory of such an event because it goes into an altered state that is much like deep sleep."
  ],
  "genera": [
    {
      "genus": "Duck Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}