{
  "id": 55,
  "name": "golduck",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "water",
        "url": "https://pokeapi.co/api/v2/type/11/"
      }
    }
  ],
  "flavor_text_entries": [
    "A Golduck is an adept swimmer. It sometimes joins competitive swimmers in training. It uses psychic powers when its forehead shimmers with light.",
    "Often seen swimming elegantly by lake shores. It is often mistaken for the Japanese monster, Kappa.",
    "It appears by waterways at dusk. It may use tele­ kinetic powers if its forehead glows mysteriously.",
    "The forelegs are webbed, helping to make it an adept swimmer. It can be seen swimming elegantly in lakes, etc.",
    "Its body is strong, and it has webbing on its hands and feet. Golduck can swim easily through rough seas, clawing its way through the high waves.",
    "It swims gracefully along on the quiet, slow-moving rivers and lakes of which it is so fond.",
    "Even fast-swimming fish Pokémon can be disabled by Golduck. It brings them to a standstill and seizes them.",
    "Golduck is the fastest swimmer among all Pokémon. It swims effortlessly, even in a rough, stormy sea. It sometimes rescues people from wrecked ships floundering in high seas.",
    "Old tales tell of Golduck punishing those that defiled its river. The guilty were dragged into the water and taken away.",
    "It is seen swimming dynamically and elegantly using its well-developed limbs and flippers.",
    "Its long, slim limbs end in broad flippers. They are used for swimming gracefully in lakes.",
    "Its slim and long limbs end in broad flippers. They are used for swimming gracefully in lakes.",
    "It swims along the banks of lakes and catches fish Pokémon. It takes them to the shore and quietly eats them up.",
    "The flippers of its well-developed limbs give it shocking speed. It is the best swimmer among Pokémon.",
    "When its forehead shines mysteriously, Golduck can use the full extent of its power.",
    "A professional swimmer, it can continue swimming for two days straight by waving its long tail skillfully.",
    "It is said that the red part of its forehead grants supernatural powers to those who possess one, so it was over-hunted in the past.",
    "It appears by waterways at dusk. It may use telekinetic powers if its forehead glows mysteriously.",
    "Often seen swimming elegantly by lakeshores. It is often mistaken for the Japanese monster Kappa.",
    "When it swims at full speed using its long, webbed limbs, its forehead somehow begins to glow.",
    "The webbed flippers on its forelegs and hind legs and the streamlined body of Golduck give it frightening speed. This Pokémon is definitely much faster than even the most athletic swimmer.",
    "A Pokémon that lives in lakes. It swims faster than any human swimming champion.",
    "This Pokémon lives in gently flowing rivers. It paddles through the water with its long limbs, putting its graceful swimming skills on display."
  ],
  "genera": [
    {
      "genus": "Duck Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}