{
  "id": 57,
  "name": "primeape",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "fighting",
        "url": "https://pokeapi.co/api/v2/type/2/"
      }
    }
  ],
  "flavor_text_entries": [
    "It will beat up anyone who makes it mad, even if it has to chase them until the end of the world.",
    "It stops being angry only when nobody else is around. To view this moment is very difficult.",
    "It has been known to become so angry that it dies as a result. Its face looks peaceful in death, however.",
    "It grows angry if you see its eyes and gets angrier if you run. If you beat it, it gets even madder.",
    "It is always outrageously furious. If it gives chase, it will tenaciously track the target no matter how far.",
    "Some researchers theorize that Primeape remains angry even when inside a Poké Ball.",
    "It becomes wildly furious if it even senses someone looking at it. It chases anyone that meets its glare.",
    "Always furious and tenacious to boot. It will not abandon chasing its quarry until it is caught.",
    "When it becomes furious, its blood circulation becomes more robust, and its muscles are made stronger. But it also becomes much less intelligent.",
    "Always furious and tenacious to boot. It will not abandon chasing its quarry until it catches up.",
    "If approached while asleep, it may awaken and angrily give chase in a groggy state of semi-sleep.",
    "When Primeape becomes furious, its blood circulation is boosted. In turn, its muscles are made even stronger. However, it also becomes much less intelligent at the same time.",
    "The blood vessels in its brain are sturdier than those of other Pokémon, so it can stay healthy despite its constant raging.",
    "It will never forgive opponents who have angered it. Even after it has beaten them down until they can’t move, it never ever forgives."
  ],
  "genera": [
    {
      "genus": "Pig Monkey Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}