{
  "id": 58,
  "name": "growlithe",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "fire",
        "url": "https://pokeapi.co/api/v2/type/10/"
      }
    }
  ],
  "flavor_text_entries": [
    "It’s both clever and loyal, but if a stranger tries to invade its territory, it barks threateningly.",
    "Extremely loyal, it will fearlessly bark at any oppo­ nent to protect its own trainer from harm.",
    "Extremely loyal to its Trainer, it will bark at those who approach the Trainer unexpectedly and run them out of town.",
    "It controls a big territory. If it detects an unknown smell, it roars loudly to force out the intruder.",
    "Extremely loyal, it will fearlessly bark at any opponent to protect its own Trainer from harm.",
    "It has lived alongside humans since ages ago. Its bones have been found in excavations of ruins from the Stone Age.",
    "It looks cute, but when you approach another Trainer’s Growlithe, it will bark at you and bite.",
    "Very friendly and faithful to people. It will try to repel enemies by barking and biting.",
    "It has a brave and trustworthy nature. It fear­ lessly stands up to bigger and stronger foes.",
    "A Pokémon with a loyal nature. It will remain motionless until it is given an order by its Trainer.",
    "Very protective of its territory. It will bark and bite to repel intruders from its space.",
    "They patrol their territory in pairs. I believe the igneous rock components in the fur of this species are the result of volcanic activity in its habitat.",
    "Growlithe has a superb sense of smell. Once it smells anything, this Pokémon won’t forget the scent, no matter what. It uses its advanced olfactory sense to determine the emotions of other living things.",
    "It is very protective of its territory. It will bark and bite to repel intruders from its space.",
    "A Pokémon with a friendly nature. However, it will bark fiercely at anything invading its territory.",
    "While it’s quite friendly toward humans once it’s grown used to them, in the wild it must be quite fierce to defend its territory from Rockruff.",
    "Its superb sense of smell ensures that this Pokémon won’t forget any scent, no matter what. It uses its sense of smell to detect the emotions of others.",
    "It has a brave and trustworthy nature. It fearlessly stands up to bigger and stronger foes."
  ],
  "genera": [
    {
      "genus": "Puppy Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}