{
  "id": 6,
  "name": "charizard",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "fire",
        "url": "https://pokeapi.co/api/v2/type/10/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "flying",
        "url": "https://pokeapi.co/api/v2/type/3/"
      }
    }
  ],
  "flavor_text_entries": [
    "It uses its wings to fly high. The temperature of its fire increases as it gains experience in battle.",
    "Its wings can carry this Pokémon close to an altitude of 4,600 feet. It blows out fire at very high temperatures.",
    "When this Pokémon expels a blast of superhot fire, the red flame at the tip of its tail burns more intensely.",
    "Breathing intense, hot flames, it can melt almost any­ thing. Its breath inflicts terrible pain on enemies.",
    "Spits fire that is hot enough to melt boulders. Known to cause forest fires unintentionally.",
    "When expelling a blast of superhot fire, the red flame at the tip of its tail burns more intensely.",
    "It spits fire that is hot enough to melt boulders. It may cause forest fires by blowing flames.",
    "When expelling a blast of super hot fire, the red flame at the tip of its tail burns more intensely.",
    "If Charizard becomes furious, the flame at the tip of its tail flares up in a light blue shade.",
    "Breathing intense, hot flames, it can melt almost anything. Its breath inflicts terrible pain on enemies.",
    "It is said that Charizard’s fire burns hotter if it has experienced harsh battles.",
    "Charizard flies around the sky in search of powerful opponents. It breathes fire of such great heat that it melts anything. However, it never turns its fiery breath on any opponent weaker than itself.",
    "If Charizard becomes furious, the flame at the tip of its tail flares up in a whitish- blue color.",
    "A Charizard flies about in search of strong opponents. It breathes intense flames that can melt any material. However, it will never torch a weaker foe."
  ],
  "genera": [
    {
      "genus": "Flame Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}