{
  "id": 61,
  "name": "poliwhirl",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "water",
        "url": "https://pokeapi.co/api/v2/type/11/"
      }
    }
  ],
  "flavor_text_entries": [
    "Its body surface is always wet and slick with an oily fluid. Because of this greasy covering, it can easily slip and slide out of the clutches of any enemy in battle.",
    "The swirl on its belly subtly undulates. Staring at it may gradually cause drowsiness.",
    "It marches over the land in search of bug Pokémon to eat. Then it takes them underwater so it can dine on them where it’s safe.",
    "Under attack, it uses its belly spiral to put the foe to sleep. It then makes its escape.",
    "Though it is skilled at walking, it prefers to live underwater where there is less danger.",
    "The surface of Poliwhirl’s body is always wet and slick with an oily fluid. Because of this greasy covering, it can easily slip and slide out of the clutches of any enemy in battle.",
    "Its health suffers when its skin dries out, so be sure to moisturize it diligently.",
    "Staring at the swirl on its belly causes drowsiness. This trait of Poliwhirl’s has been used in place of lullabies to get children to go to sleep.",
    "This Pokémon’s sweat is a slimy mucus. When captured, Poliwhirl can slither from its enemies’ grasp and escape.",
    "Although it can live on land, it prefers to stay in the water, where it has fewer natural enemies.",
    "Although it has become capable of living on land, it spends its time in the water, where its prey, fish Pokémon, are plentiful.",
    "Its two legs are well developed. Even though it can live on the ground, it prefers living in water.",
    "The surface of Poliwhirl’s body is always wet and slick with a slimy fluid. Because of this slippery covering, it can easily slip and slide out of the clutches of any enemy in battle.",
    "Under attack, it uses its belly  spiral to put the foe to sleep. It then makes its escape.",
    "The skin on most of its body is moist. However, the skin on its belly spiral feels smooth.",
    "Capable of living in or out of water. When out of water, it sweats to keep its body slimy.",
    "It can live in or out of water. When out of water, it constantly sweats to keep its body slimy.",
    "The spiral pattern on its belly subtly undulates. Staring at it gradually causes drowsiness."
  ],
  "genera": [
    {
      "genus": "Tadpole Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}