{
  "id": 64,
  "name": "kadabra",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "psychic",
        "url": "https://pokeapi.co/api/v2/type/14/"
      }
    }
  ],
  "flavor_text_entries": [
    "This Pokémon’s telekinesis is immensely powerful. To prepare for evolution, Kadabra stores up psychic energy in the star on its forehead.",
    "It emits special alpha waves from its body that induce headaches just by being close by.",
    "A theory exists that this Pokémon was a young boy who couldn’t control his psychic powers and ended up transformed into this Pokémon.",
    "It possesses strong mental capabilities, but its psychic powers are halved when it’s not holding a silver spoon.",
    "When it uses its psychic power, it emits strong alpha waves that can ruin precision devices.",
    "When it closes its eyes, twice as many alpha parti­ cles come out of the surface of its body.",
    "It stares at its silver spoon to focus its mind. It emits more alpha waves while doing so.",
    "Kadabra emits a peculiar alpha wave if it develops a headache. Only those people with a particularly strong psyche can hope to become a Trainer of this Pokémon.",
    "It emits special alpha waves from its body that induce headaches just by being close.",
    "Kadabra holds a silver spoon in its hand. The spoon is used to amplify the alpha waves in its brain. Without the spoon, the Pokémon is said to be limited to half the usual amount of its telekinetic powers.",
    "It stares at a silver spoon to amplify its psychic powers before it lets loose. Apparently, gold spoons are no good.",
    "Many odd things happen if this Pokémon is close by. For example, it makes clocks run backward.",
    "Kadabra emits a peculiar alpha wave if it develops a headache. Only those people with a particularly strong psyche can hope to become a TRAINER of this Pokémon.",
    "It is rumored that a boy with psychic abilities suddenly transformed into Kadabra while he was assisting research into extrasensory powers.",
    "When it uses its psychic power, it emits strong ha waves that can ruin precision devices.",
    "If it uses its abilities, it emits special alpha waves that cause machines to malfunction.",
    "If one is nearby, an eerie shadow appears on TV screens. Seeing the shadow is said to bring bad luck.",
    "It possesses strong spiritual power. The more danger it faces, the stronger its psychic power.",
    "There are rumors that a child with mystical powers became a Kadabra; however, this remains unverified. I suspect that the spoon Kadabra holds enhances its brain waves.",
    "It happened one morning - a boy with extrasensory powers awoke in bed transformed into Kadabra.",
    "Using its psychic power, Kadabra levitates as it sleeps. It uses its springy tail as a pillow.",
    "Many odd things happen if this Pokémon is close by. For example, it makes clocks run backwards.",
    "Kadabra’s presence infests televisions and monitors with creepy shadows that bring bad luck."
  ],
  "genera": [
    {
      "genus": "Psi Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}