{
  "id": 65,
  "name": "alakazam",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "psychic",
        "url": "https://pokeapi.co/api/v2/type/14/"
      }
    }
  ],
  "flavor_text_entries": [
    "Its brain can outperform a supercomputer. Its IQ (intelligence quotient) is said to be around 5,000.",
    "If it trusts someone deeply, it will let them have one of its spoons. Anything you eat with that spoon is apparently delicious.",
    "Its brain cells continue to increase in number until its death. The older the Alakazam, the larger its head.",
    "Closing both its eyes heightens all its other senses. This enables it to use its abilities to their extremes.",
    "It does not like physical attacks very  much. Instead, it freely uses extrasensory powers to defeat foes.",
    "It is said to have an IQ of approximately 5,000. Its overflowing psychokinetic powers cause headaches to anyone nearby.",
    "Its highly developed brain is on par with a supercomputer. It can use all forms of psychic abilities.",
    "Alakazam uses its psychic powers to make the spoons it carries. Each spoon is an original that there’s only one of in the whole world.",
    "Alakazam’s brain continually grows, making its head far too heavy to support with its neck. This Pokémon holds its head up using its psychokinetic power instead.",
    "The spoons clutched in its hands are said to have been created by its psychic powers.",
    "It has an incredibly high level of intelligence. Some say that Alakazam remembers everything that ever happens to it, from birth till death.",
    "Its superb memory lets it recall everything it has experienced from birth. Its IQ exceeds 5,000.",
    "Alakazam wields potent psychic powers. It’s said that this Pokémon used these powers to create the spoons it holds.",
    "It has an IQ of 5000. It calculates many things in order to gain the edge in every battle.",
    "A Pokémon that can memorize anything. It never forgets what it learns—that’s why this Pokémon is smart.",
    "The longer Alakazam lives, the larger and heavier its head becomes. Our tests have shown that the strength of its psychic powers correlates positively to the weight of its head.",
    "While it has strong psychic abilities and high intelligence, an Alakazam’s muscles are very weak. It uses psychic power to move its body.",
    "Alakazam’s brain continually grows, infinitely multiplying brain cells. This amazing brain gives this Pokémon an astoundingly high IQ of 5,000. It has a thorough memory of everything that has occurred in the world.",
    "Its brain can outperform a supercomputer. Its intelligence quotient is said to be 5,000.",
    "Its brain cells multiply continually until it dies. As a result, it remembers everything.",
    "A Pokémon that can memorize anything. It never forgets what it learns-- that's why this Pokémon is smart."
  ],
  "genera": [
    {
      "genus": "Psi Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}