{
  "id": 66,
  "name": "machop",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "fighting",
        "url": "https://pokeapi.co/api/v2/type/2/"
      }
    }
  ],
  "flavor_text_entries": [
    "It likes food that’s highly nutritious because its instincts drive it to build muscle efficiently.",
    "With its superhuman strength, it’s able to throw a hundred people all at the same time. Its strength comes from lifting Graveler every day.",
    "Once this Pokémon has gained enough confidence and muscle from training with its friends, it challenges Makuhita to a battle.",
    "Machop exercises by hefting around a GRAVELER as if it were a barbell. There are some Machop that travel the world in a quest to master all kinds of martial arts.",
    "Always brimming with power, it passes time by lifting boulders. Doing so makes it even stronger.",
    "Its muscles never cramp however much it trains. It lives in the mountains away from humans.",
    "Its whole body is composed of muscles. Even though it’s the size of a human child, it can hurl 100 grown-ups.",
    "Loves to build its muscles. It trains in all styles of martial arts to become even stronger.",
    "It loves to work out and build its muscles. It is never satisfied, even if it trains hard all day long.",
    "Though as small as a child, it has strength enough to easily throw a well-built adult. Striving to become ever stronger, Machop trains by carrying a Graveler on its shoulders.",
    "It hefts a Graveler repeatedly to strengthen its entire body. It uses every type of martial arts.",
    "Machop’s muscles are special - they never get sore no matter how much they are used in exercise. This Pokémon has sufficient power to hurl a hundred adult humans.",
    "It hefts a GRAVELER repeatedly to strengthen its entire body. It uses every type of martial arts.",
    "It continually undertakes strenuous training to master all forms of martial arts. Its strength lets it easily hoist a sumo wrestler onto its shoulders.",
    "It loves working out. As it gazes at its muscles, which continue to swell day by day, it becomes more and more dedicated to its training.",
    "It trains by lifting rocks in the mountains. It can even pick up a GRAVELER with ease.",
    "Very powerful in spite of its small size. Its mastery of many types of martial arts makes it very tough.",
    "Though small in stature, it is powerful enough to easily heft and throw a number of GEODUDE at once.",
    "Though small in stature, it is powerful enough to easily heft and throw a number of Geodude at once.",
    "Machop’s muscles are special—they never get sore no matter how much they are used in exercise. This Pokémon has sufficient power to hurl a hundred adult humans.",
    "Machop exercises by hefting around a Graveler as if it were a barbell. There are some Machop that travel the world in a quest to master all kinds of martial arts."
  ],
  "genera": [
    {
      "genus": "Superpower Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}