{
  "id": 68,
  "name": "machamp",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "fighting",
        "url": "https://pokeapi.co/api/v2/type/2/"
      }
    }
  ],
  "flavor_text_entries": [
    "It is impossible to defend against punches and chops doled out by its four arms. Its fighting spirit flares up when it faces a tough opponent.",
    "Machamp has the power to hurl anything aside. However, trying to do any work requiring care and dexterity causes its arms to get tangled. This Pokémon tends to leap into action before it thinks.",
    "In close combat, its four arms afford it offensive and defensive supremacy. In but a blink, this valiant Pokémon can overwhelm its foes with more than 1,000 blows from its fists.",
    "It can lift heavy loads with the greatest of ease. It can even heft dump trucks. But its clumsy fingers prevent it from doing any precision work.",
    "Using its heavy muscles, it throws powerful punches that can send the victim clear over the horizon.",
    "It uses its four powerful arms to pin the limbs of its foe, then throws the victim over the horizon.",
    "It punches with its four arms at blinding speed. It can launch 1,000 punches in two seconds.",
    "It unleashes megaton-level punches that send opponents flying clear over the horizon.",
    "Machamp is known as the Pokémon that has mastered every kind of martial arts. If it grabs hold of the foe with its four arms, the battle is all but over. The hapless foe is thrown far over the horizon.",
    "With four arms, it can attack and defend simultaneously. It’s said to have mastered every martial art in the world.",
    "It grasps its opponents with its four arms and twists them up in an intricate hold. People call it “the Machamp special. ”",
    "Its four ruggedly developed arms can launch a flurry of 1,000 punches in just two seconds.",
    "With four arms that react more quickly than it can think, it can execute many punches at once.",
    "One arm alone can move mountains. Using all four arms, this Pokémon fires off awesome punches.",
    "It can knock a train flying with a punch. However, it is terrible at delicate work using its fingers.",
    "It quickly swings its four arms to rock its opponents with ceaseless punches and chops from all angles.",
    "Its four muscled arms slam foes with powerful punches and chops at blinding speed.",
    "Its superpowerful punches are said to knock the victim flying clear over the horizon."
  ],
  "genera": [
    {
      "genus": "Superpower Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}