{
  "id": 71,
  "name": "victreebel",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "grass",
        "url": "https://pokeapi.co/api/v2/type/12/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "poison",
        "url": "https://pokeapi.co/api/v2/type/4/"
      }
    }
  ],
  "flavor_text_entries": [
    "Lures prey with the sweet aroma of honey. Swallowed whole, the prey is dissolved in a day, bones and all.",
    "Lures prey with the sweet aroma of honey. Swallowed whole, the prey is melted in a day, bones and all.",
    "It pools in its mouth a fluid with a honeylike scent, which is really an acid that dissolves anything.",
    "Lures prey into its mouth with a honeylike aroma. The helpless prey is melted with a dissolving fluid.",
    "Acid that has dissolved many prey becomes sweeter, making it even more effective at attracting prey.",
    "Once ingested into this Pokémon's body, even the hardest object will melt into nothing.",
    "It pools in its mouth a fluid with a honey-like scent, which is really an acid that dissolves anything.",
    "This horrifying plant Pokémon attracts prey with aromatic honey, then melts them in its mouth.",
    "The long vine extending from its head is waved about as if it were a living thing to attract prey. When an unsuspecting victim approaches, it is swallowed whole.",
    "Once ingested into this Pokémon’s body, even the hardest object will melt into nothing.",
    "Said to live in huge colonies deep in jungles, although no one has ever returned from there.",
    "ACID that has dissolved many prey becomes sweeter, making it even more effective at attracting prey.",
    "Victreebel has a long vine that extends from its head. This vine is waved and flicked about as if it were an animal to attract prey. When an unsuspecting prey draws near, this Pokémon swallows it whole."
  ],
  "genera": [
    {
      "genus": "Flycatcher Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}