{
  "id": 82,
  "name": "magneton",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "electric",
        "url": "https://pokeapi.co/api/v2/type/13/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "steel",
        "url": "https://pokeapi.co/api/v2/type/9/"
      }
    }
  ],
  "flavor_text_entries": [
    "The MAGNEMITE are united by a magnetism so powerful, it dries all moisture in its vicinity.",
    "This Pokémon is three Magnemite that have linked together. Magneton sends out powerful radio waves to study its surroundings.",
    "Generates strange radio signals. It raises the temperature by 3. 6 degrees Fahrenheit within 3,300 feet.",
    "Magneton emits a powerful magnetic force that is fatal to mechanical devices. As a result, large cities sound sirens to warn citizens of large-scale outbreaks of this Pokémon.",
    "Magneton emits a powerful magnetic force that is fatal to electronics and precision instruments. Because of this, it is said that some towns warn people to keep this Pokémon inside a POKé BALL.",
    "Three Magnemite gathered to evolve into this Pokémon. The source of much vexation on my part, as its powerful magnetism destroys my research equipment.",
    "Many mysteriously appear when more sunspots dot the sun. They stop TV sets from displaying properly.",
    "Generates strange radio signals. It raises the tem­ perature by 3. 6F degrees within 3,300 feet.",
    "It is actually three MAGNEMITE linked by magnetism. A group can set off a magnetic storm.",
    "Delicate equipment can malfunction in areas inhabited by Magneton, which send out mysterious electrical signals.",
    "The stronger electromagnetic waves from the three linked Magnemite are enough to dry out surrounding moisture.",
    "This Pokémon is constantly putting out a powerful magnetic force. Most computers go haywire when a Magneton approaches.",
    "When rain clouds form, many Magneton gather in high places to wait for lightning to strike.",
    "A linked cluster formed of several Magnemite. It discharges powerful magnetic waves at high voltage.",
    "When many Magneton gather together, the resulting magnetic storm disrupts radio waves.",
    "Three MAGNEMITE are linked by a strong magnetic force. Earaches will occur if you get too close.",
    "It is actually three MAGNEMITE linked by magnetism. It generates powerful radio waves that raise temperatures by 3. 6 degrees F within a 3,300-foot radius.",
    "The MAGNEMITE are united by a magnetism so power­ ful, it dries all moisture in its vicinities.",
    "When three Magnemite link together, their brains also become one. They do not become three times more intelligent.",
    "Formed by several MAGNEMITE linked together. They frequently appear when sunspots flare up.",
    "Formed by several MAGNEMITEs linked together. They frequently appear when sunspots flare up.",
    "A linked cluster formed of several MAGNEMITE. It discharges powerful magnetic waves at high voltage.",
    "Magneton emits a powerful magnetic force that is fatal to electronics and precision instruments. Because of this, it is said that some towns warn people to keep this Pokémon inside a Poké Ball.",
    "It has about three times the electrical power of Magnemite. For some reason, outbreaks of this Pokémon happen when lots of sunspots appear."
  ],
  "genera": [
    {
      "genus": "Magnet Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}