{
  "id": 86,
  "name": "seel",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "water",
        "url": "https://pokeapi.co/api/v2/type/11/"
      }
    }
  ],
  "flavor_text_entries": [
    "Loves freezing cold conditions. Relishes swimming in a frigid climate of around 14F degrees.",
    "Covered with light blue fur, its hide is thick and tough. It is active in bitter cold of minus 40 degrees Fahrenheit.",
    "Loves freezing-cold conditions. Relishes swimming in a frigid climate of around 14 degrees Fahrenheit.",
    "It has always been supposed that Seel live only in cold seas. Their having shown up in Alola is a mystery.",
    "The light blue fur that covers it keeps it protected against the cold. It loves iceberg- filled oceans.",
    "A Pokémon that lives on icebergs. It swims in the sea using the point on its head to break up ice.",
    "Seel hunt for prey in frigid, ice-covered seas. When it needs to breathe, it punches a hole through the ice with the sharply protruding section of its head.",
    "The colder it gets, the better it feels. It joyfully swims around oceans so cold that they are filled with floating ice.",
    "The protruding horn on its head is very hard. It is used for bashing through thick icebergs.",
    "In daytime, it is often found asleep on the seabed in shallow waters. Its nostrils close while it swims.",
    "Thanks to its thick fat, cold seas don’t bother it at all, but it gets tired pretty easily in warm waters.",
    "Covered with light blue fur, its hide is thick and tough. It is active in bitter cold of -40 degrees Fahrenheit.",
    "Although it can't walk well on land, it is a graceful swimmer. It especially loves being in frigid seas.",
    "The protruding horn on its head is very hard. It is used for bashing through thick ice.",
    "Seel hunts for prey in the frigid sea underneath sheets of ice. When it needs to breathe, it punches a hole through the ice with the sharply protruding section of its head.",
    "Although it can’t walk well on land, it is a graceful swimmer. It especially loves being in frigid seas."
  ],
  "genera": [
    {
      "genus": "Sea Lion Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}