{
  "id": 90,
  "name": "shellder",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "water",
        "url": "https://pokeapi.co/api/v2/type/11/"
      }
    }
  ],
  "flavor_text_entries": [
    "It swims facing backward by opening and closing its two-piece shell. It is surprisingly fast.",
    "Even when its shell is closed, its tongue still hangs out. If you give its tongue a good yank, the shock will cause Shellder to open its shell.",
    "Clamping on to an opponent reveals its vulnerable parts, so it uses this move only as a last resort.",
    "It swims backward by opening and closing its two shells. Its large tongue is always kept hanging out.",
    "It is encased in a shell that is harder than diamond. Inside, however, it is surprisingly tender.",
    "Grains of sand trapped in its shells mix with its body fluids to form beautiful pearls.",
    "At night, it burrows a hole in the seafloor with its broad tongue to make a place to sleep. While asleep, it closes its shell, but leaves its tongue hanging out.",
    "The shell can withstand any attack. However, when it is open, the tender body is exposed.",
    "The sand that accumulates inside its shell eventually becomes a pearl. But the pearl gets in the way, so it spits it out and discards it.",
    "This Pokémon’s tongue is always hanging out. It uses its tongue with great dexterity to dig up sand from the seabed in its search for food.",
    "Its hard shell repels any kind of attack. It is vulnerable only when its shell is open.",
    "The hardness of its shell surpasses the hardness of a diamond. In days gone by, people used the shells to make shields.",
    "At night, this Pokémon uses its broad tongue to burrow a hole in the seafloor sand and then sleep in it. While it is sleeping, Shellder closes its shell, but leaves its tongue hanging out."
  ],
  "genera": [
    {
      "genus": "Bivalve Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}