{
  "id": 91,
  "name": "cloyster",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "water",
        "url": "https://pokeapi.co/api/v2/type/11/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "ice",
        "url": "https://pokeapi.co/api/v2/type/15/"
      }
    }
  ],
  "flavor_text_entries": [
    "Excavation of the tombs of ancient hunting tribes has turned up many spears tipped with spikes that had fallen off this Pokémon’s shell.",
    "When attacked, it launches its horns in quick volleys. Its innards have never been seen.",
    "Cloyster is capable of swimming in the sea. It does so by swallowing water, then jetting it out toward the rear. This Pokémon shoots spikes from its shell using the same system.",
    "Even a missile can't break the spikes it uses to stab opponents. They're even harder than its shell.",
    "Cloyster that live in seas with harsh tidal currents grow large, sharp spikes on their shells.",
    "Slowpoke tails are its favorite food. It has even been known to come up on land to look for Slowpoke from time to time.",
    "Once it slams its shell shut, it is impossible to open, even by those with superior strength.",
    "It fights by keeping its shell tightly shut for protection and by shooting spikes to repel foes.",
    "For protection, it uses its harder- than-diamonds shell. It also shoots spikes from the shell.",
    "Its hard shell cannot be shattered—not even by a bomb. The contents of the shell remain unknown.",
    "For protection, it uses its harder-than-diamond shell. It also shoots spikes from the shell.",
    "It swims in the sea by swallowing water, then jetting it out toward the rear. The Cloyster shoots spikes from its shell using the same system.",
    "If areas of Cloyster’s very hard shell get damaged, those areas swell, gradually growing into large sharp spikes.",
    "Its shell is extremely hard. It cannot be shattered, even with a bomb. The shell opens only when it is attacking."
  ],
  "genera": [
    {
      "genus": "Bivalve Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}