{
  "id": 92,
  "name": "gastly",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "ghost",
        "url": "https://pokeapi.co/api/v2/type/8/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "poison",
        "url": "https://pokeapi.co/api/v2/type/4/"
      }
    }
  ],
  "flavor_text_entries": [
    "A Pokémon born from poison gases. It defeats even the largest foes by enveloping them in gas.",
    "Gastly is largely composed of gaseous matter. When exposed to a strong wind, the gaseous body quickly dwindles away. Groups of this Pokémon cluster under the eaves of houses to escape the ravages of wind.",
    "This Pokémon’s body is 95% made up of gases, which are blown away by strong gusts of wind.",
    "Its body is made of gas. Despite lacking substance, it can envelop an opponent of any size and cause suffocation.",
    "A being that exists as a thin gas. It can topple an Indian elephant by enveloping the prey in two seconds.",
    "When exposed to a strong wind, a Gastly’s gaseous body quickly dwindles away. They cluster under the eaves of houses to escape the ravages of wind.",
    "Said to appear in decrepit, deserted buildings. It has no real shape, as it appears to be made of a gas.",
    "Gaseous and completely impalpable. Also highly dangerous— inhaling part of its poisonous body will cause one to faint instantly.",
    "Its thin body is made of gas. It can envelop an opponent of any size and cause suffocation.",
    "Should a strange light be seen flickering in an abandoned building, Gastly is lurking there.",
    "Although Gastly is barely visible, when it’s near, a faint sweet smell lingers.",
    "It’s said that gas emanating from a graveyard was possessed by the grievances of the deceased and thus became a Pokémon.",
    "With its gas-like body, it can sneak into any place it desires. However, it can be blown away by wind.",
    "Said to appear in decrepit, deserted buildings. It has no real shape as it appears to be made of a gas.",
    "Poisonous gas comprises 95% of its body. It’s said that the remaining 5% is made up of the souls of those who died from the gas.",
    "It wraps its opponent in its gas- like body, slowly weakening its prey by poisoning it through the skin.",
    "Almost invisible, this gaseous Pokémon cloaks the target and puts it to sleep without notice.",
    "Born from gases, anyone would faint if engulfed by its gaseous body, which contains poison."
  ],
  "genera": [
    {
      "genus": "Gas Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}