{
  "id": 94,
  "name": "gengar",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "ghost",
        "url": "https://pokeapi.co/api/v2/type/8/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "poison",
        "url": "https://pokeapi.co/api/v2/type/4/"
      }
    }
  ],
  "flavor_text_entries": [
    "Hiding in people’s shadows at night, it absorbs their heat. The chill it causes makes the victims shake.",
    "Sometimes, on a dark night, your shadow thrown by a streetlight will suddenly and startlingly overtake you. It is actually a Gengar running past you, pretending to be your shadow.",
    "The leer that floats in darkness belongs to a Gengar delighting in casting curses on people.",
    "Hiding in people's shadows at night, it absorbs their heat. The chill it causes makes the victims shake.",
    "A Gengar is close by if you feel a sudden chill. It may be trying to lay a curse on you.",
    "Even your home isn’t safe. Gengar will lurk in whatever dark corner of a room it can find and wait for its chance to catch its prey.",
    "Deep in the night, your shadow cast by a streetlight may suddenly overtake you. It is actually a Gengar running past you, pretending to be your shadow.",
    "It hides in shadows. It is said that if Gengar is hiding, it cools the area by nearly 10 degrees Fahrenheit.",
    "It apparently wishes for a traveling companion. Since it was once human itself, it tries to create one by taking the lives of other humans.",
    "It is said to emerge from darkness to steal the lives of those who become lost in mountains.",
    "Lurking in the shadowy corners of rooms, it awaits chances to steal its prey’s life force.",
    "To steal the life of its target, it slips into the prey's shadow and silently waits for an opportunity.",
    "You can hear tales told all over the world about how Gengar will pay a visit to children who are naughty.",
    "Under a full moon, this Pokémon likes to mimic the shadows of people and laugh at their fright.",
    "To steal the life of its target, it slips into the prey’s shadow and silently waits for an opportunity.",
    "On the night of a full moon, if shadows move on their own and laugh, it must be Gengar’s doing.",
    "Possesses potential victims' shadows in an effort to steal away the victims' lives. If your shadow begins to laugh, you must take hold of a protective charm posthaste!",
    "Should you feel yourself attacked by a sudden chill, it is evidence of an approaching Gengar. There is no escaping it. Give up.",
    "It hides in shadows. It is said that if Gengar is hiding, it cools the area by nearly 10 degrees F.",
    "It steals heat from its surroundings. If you feel a sudden chill, it is certain that a Gengar appeared."
  ],
  "genera": [
    {
      "genus": "Shadow Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}