{
  "id": 95,
  "name": "onix",
  "types": [
    {
      "slot": 1,
      "type": {
        "name": "rock",
        "url": "https://pokeapi.co/api/v2/type/6/"
      }
    },
    {
      "slot": 2,
      "type": {
        "name": "ground",
        "url": "https://pokeapi.co/api/v2/type/5/"
      }
    }
  ],
  "flavor_text_entries": [
    "Burrows at high speed in search of food. The tunnels it leaves are used as homes by DIGLETTs.",
    "It twists and squirms through the ground. The thunderous roar of its tunneling echoes a long way.",
    "As it digs through the ground, it absorbs many hard objects. This is what makes its body so solid.",
    "It burrows through the ground at a speed of 50 mph while feeding on large boulders. ",
    "As it grows, the stone portions of its body harden to become similar to a diamond, but colored black.",
    "Opening its large mouth, it ingests massive amounts of soil and creates long tunnels.",
    "When it travels underground, it causes rumbling and tremors. It can move at 50 mph.",
    "It rapidly bores through the ground at 50 mph by squirming and twisting its massive, rugged body.",
    "It squirms through the ground using its long and rugged body. It always eats while burrowing.",
    "There is a magnet in its brain that prevents an Onix from losing direction while tunneling. As it grows older, its body becomes steadily rounder and smoother.",
    "This chain of immense stones resembles a giant serpent. Tremors shake the earth above as it burrows deep beneath the ground, feeding on boulders as it goes.",
    "It burrows through the ground at a speed of 50 mph while feeding on large boulders.",
    "Onix has a magnet in its brain. It acts as a compass so that this Pokémon does not lose direction while it is tunneling. As it grows older, its body becomes increasingly rounder and smoother.",
    "As it grows, the stone portions of its body harden to become similar to black-colored diamonds.",
    "Burrows at high speed in search of food. The tunnels it leaves are used as homes by Diglett.",
    "It usually lives underground. It searches for food while boring its way through the ground at 50 miles per hour."
  ],
  "genera": [
    {
      "genus": "Rock Snake Pokémon",
      "language": {
        "name": "en",
        "url": "https://pokeapi.co/api/v2/language/9/"
      }
    }
  ]
}